
/** 说明：目前主要是返回，下拉列表数据 */

    /**<pre>
     *
     * URL：public/baseWebDat
     *
     * 主参数(f)：
     * f=uxCode   选择：Code相关
     * f=uxDep    选择：部门
     * f=uxRsh    选择：教研组
     * f=uxCla    选择：班级
     * f=uxDorm   选择：宿舍
     * f=uxTerm   选择：学期
     * f=uxCou    选择：课程
     * f=uxThr    选择：教师
     * f=uxRom    选择：场地
     * f=uxBui    选择：教学楼
     * f=uxCam    选择：校区
     *
     * 排课相关
     * f=uxThrAndGrp   选择：教师+教师组
     * f=uxClaAndGrp   选择：班级+班级组
     * f=uxRomAndGrp   选择：场地+场地组
     * f=uxThrGrp      选择：教师组
     * f=uxDepM        选择：部门负责人--部门
     * f=uxThrAndGrpM  选择：部门负责人--教师+教师组
     *
     * 选课相关
     * f=uxXkPlan  选择：待选计划
     * f=uxSelCou  选择：待选课
     *
     */

    //==================================================================================================================
    // 代码信息 － uxCode
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     * 功能：Code相关下拉选择信息
     *
     * 参数：
     * codeType   必需   代码类型
     * infType    可选   1=返回[no,name]，否则返回[id,name]
     * addType    可选   1=附加[0,无限制]
     * active     可选   状态：1有效、2无效
     * simple     可选   0 = 返回：{"dataList":[{'id':'?','name':'?'},...]}
     *                   默认返回：[[id,name],...]
     */

    //==================================================================================================================
    // 基础信息
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     * 功能：学部 -- uxDep
     *
     * 参数：
     * addType   可选   附加类型：1=附加[0,无限制]
     * state     可选   状态：1草稿、2正常、3关闭、4历史
     * simple    可选   0 = 返回：{"dataList":[{'id':'?','name':'?'},...]}
     *                  默认返回：[[id,name],...]
     */

    //==================================================================================================================
    /**<pre>
     * 功能：教研组 -- uxRsh
     *
     * 参数：
     * addType   可选   附加类型：1=附加[0,无限制]
     * state     可选   状态：1草稿、2正常、3关闭、4历史
     * simple    可选   0 = 返回：{"dataList":[{'id':'?','name':'?'},...]}
     *                  默认返回：[[id,name],...]
     *
     */

    //==================================================================================================================
    /**<pre>
     * 功能：班级 -- uxCla
     *
     * 参数：
     * addType   可选   附加：1=[0,无限制]
     * claGrpId  可选   班级组Id（注该条件有效，则以下4个条件被忽略）
     * grade     可选   年级(Id)
     * depId     可选   学部Id
     * claType   可选   班级类型：1行政班、2教学班、3升学班、4就业班、10非教学班
     * userType  可选   权限类型：1所有班级(默认)、2自己是班主任
     *                            3自己任课、4自已是班主任+自己任课
     *                            注：高级用户总是返回所有班级
     * state     可选   状态：1草稿、2正常、3关闭、4历史
     * simple    可选   0 = 返回：{"dataList":[{'id':'?','name':'?'},...]}
     *                  默认返回：[[id,name],...]
     *
     * 正确返回：{"success":true,"total":"总记录数","dataList":[id,name]}
     *
     */

    //==================================================================================================================
    /**<pre>
     * 功能：宿舍 -- uxDorm
     *
     * 参数：
     * addType   可选   附加类型：1=附加[0,无限制]
     * state     可选   状态：1草稿、2正常、3关闭、4历史
     * simple    可选   0 = 返回：{"dataList":[{'id':'?','name':'?'},...]}
     *                  默认返回：[[id,name],...]
     *
     */

    //==================================================================================================================
    /**<pre>
     * 功能：学期 -- uxTerm
     *
     * 参数：
     * addType   可选   附加类型：1=附加[0,无限制]
     * addId     可选   增加一个学期Id
     * state     可选   状态：1草稿、2正常、3关闭、4历史
     * simple    可选   0 = 返回：{"dataList":[{'id':'?','name':'?'},...]}
     *                  默认返回：[[id,name],...]
     */

    //==================================================================================================================
    /**<pre>
     * 功能：课程 -- uxCou
     *
     * 参数：
     * addType   可选   附加类型：1=附加[0,无限制]、5=附加[-1,总成绩][-2,语数英]
     * state     可选   状态：1草稿、2正常、3关闭、4历史
     * simple    可选   0 = 返回：{"dataList":[{'id':'?','name':'?'},...]}
     *                  默认返回：[[id,name],...]
     */

    //==================================================================================================================
    /**<pre>
     * 功能：教师 -- uxThr
     *
     * 参数：
     * addType     可选   附加类型：1=附加[0,无限制]
     * depId       可选   学部Id
     * thrGroupId  可选   教师组Id (如果存在学部Id，则忽略该条件，即学部与教师组这2个条件同时只能用其中1个)
     * state       可选   状态：默认查所有
     * simple      可选   0 = 返回：{"dataList":[{'id':'?','name':'?'},...]}
     *                    默认返回：[[id,name],...]
     *
     * 注：depId 有效，state 对应 T_DepThr.F_State
     * 注：thrGroupId 有效，state 被忽略
     *
     */

    //==================================================================================================================
    /**<pre>
     * 功能：场地 -- uxRom
     *
     * 参数：
     * addType   可选   附加类型：1=附加[0,无限制]
     * state     可选   状态：1草稿、2正常、3关闭、4历史
     * simple    可选   0 = 返回：{"dataList":[{'id':'?','name':'?'},...]}
     *                  默认返回：[[id,name],...]
     */

    //==================================================================================================================
    /**<pre>
     * 功能：教学楼 -- uxBui
     *
     * 参数：
     * addType   可选   附加类型：1=附加[0,无限制]
     * state     可选   状态：1草稿、2正常、3关闭、4历史
     * simple    可选   0 = 返回：{"dataList":[{'id':'?','name':'?'},...]}
     *                  默认返回：[[id,name],...]
     */

    //==================================================================================================================
    /**<pre>
     * 功能：校区 -- uxCam
     *
     * 参数：
     * addType   可选   附加类型：1=附加[0,无限制]
     * state     可选   状态：1草稿、2正常、3关闭、4历史
     * simple    可选   0 = 返回：{"dataList":[{'id':'?','name':'?'},...]}
     *                  默认返回：[[id,name],...]
     */

    //==================================================================================================================
    // 排课相关
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     * 功能：教师和教师组 -- uxThrAndGrp
     *
     * 参数：
     * addType   可选   附加类型：1=附加[0,无限制]
     * state     可选   状态：1草稿、2正常、3关闭、4历史
     * simple    可选   0 = 返回：{"dataList":[{'id':'?','name':'?'},...]}
     *                  默认返回：[[id,name],...]
     */

    //==================================================================================================================
    /**<pre>
     * 功能：班级和班级组（注意：班级组不受“grade、claType”这2个条件的限制）-- uxClaAndGrp
     *
     * 参数：
     * addType   可选   附加类型：1=附加[0,无限制]
     * grade     可选   年级段
     * depId     可选   学部Id
     * claType   可选   班级类型：1行政班、2教学班、3升学班、4就业班、10非教学班
     * state     可选   状态：1草稿、2正常、3关闭、4历史
     * simple    可选   0 = 返回：{"dataList":[{'id':'?','name':'?'},...]}
     *                  默认返回：[[id,name],...]
     */

    //==================================================================================================================
    /**<pre>
     * 功能：场地和场地组 -- uxRomAndGrp
     *
     * 参数：
     * addType   可选   附加类型：1=附加[0,无限制]
     * state     可选   状态：1草稿、2正常、3关闭、4历史
     * simple    可选   0 = 返回：{"dataList":[{'id':'?','name':'?'},...]}
     *                  默认返回：[[id,name],...]
     */

    //==================================================================================================================
    /**<pre>
     * 功能：教师组 -- uxThrGrp
     *
     * 参数：
     * addType   可选   附加类型：1=附加[0,无限制]
     * state     可选   状态：1草稿、2正常、3关闭、4历史
     * simple    可选   0 = 返回：{"dataList":[{'id':'?','name':'?'},...]}
     *                  默认返回：[[id,name],...]
     */

    //==================================================================================================================
    //==================================================================================================================
    /**<pre>
     * 功能：部门 -- uxDepM
     * 用户：高级用户、部门负责人(自己负责的部门)
     *
     * 特殊：高级用户附加[-1,高级用户专属]
     *
     * 参数：
     * addType   可选   附加类型：1=附加[0,无限制]
     * state     可选   状态：1草稿、2正常、3关闭、4历史
     * simple    可选   0 = 返回：{"dataList":[{'id':'?','name':'?'},...]}
     *                  默认返回：[[id,name],...]
     */

    //==================================================================================================================
    /**<pre>
     * 功能：教师+教师组列表 -- uxThrAndGrpM
     * 用户：高级用户、部门负责人(自己负责的部门)
     *
     * 参数：
     * addType   可选   附加类型：1=附加[0,无限制]
     * state     可选   状态：1草稿、2正常、3关闭、4历史
     * simple    可选   0 = 返回：{"dataList":[{'id':'?','name':'?'},...]}
     *                  默认返回：[[id,name],...]
     */

    //==================================================================================================================
    // 选课相关
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     * 功能：选课计划 -- uxXkPlan
     *
     * 参数：
     * termId    可选   学期Id
     * addType   可选   附加类型：1=附加[0,无限制]
     * state     可选   状态：1未开启、2开启、3关闭、4完成
     * simple    可选   0 = 返回：{"dataList":[{'id':'?','name':'?'},...]}
     *                  默认返回：[[id,name],...]
     */

    //==================================================================================================================
    /**<pre>
     * 功能：待选课程下拉选择信息 -- uxSelCou
     *
     * 参数：
     * xkpId     2选1   选课计划Id
     * planNO    2选1   选课计划编号 如果存在xkpId，则忽略这个参数
     * stuId     可选   学生Id
     * stuNO     可选   学号 如果存在stuId，则忽略这个参数
     * addType   可选   附加类型：1=附加[0,无限制]
     * state     可选   状态：1未开启、2开启、3关闭、4完成
     * simple    可选   0 = 返回：{"dataList":[{'id':'?','name':'?'},...]}
     *                  默认返回：[[id,name],...]
     */

