/** 学期 */

    /** 自增流水号   */ private Integer autoId   ;
    /** 学期编号     */ private String  nO       ;
    /** 学期名称     */ private String  name     ;
    /** 开学日期     */ private Date    startDate;
    /** 结束日期     */ private Date    endDate  ;
    /** 首个周一日期 */ private Date    firstMon ;
    /** 周数         */ private Byte    weeks    ;
    /** 当前学期     */ private Byte    cur      ; //1当前学期 2非当前学期(默认)
    /** 备注         */ private String  remark   ;
    /** 状态         */ private Byte    state    ; //1草稿、2正常(默认)、3关闭、4历史

    /** 按编号排序 */ private Byte   orderO ;
    /** 按名称排序 */ private Byte   orderN ;
	/** 学期Id(组) */ private String autoIds; //多个用“,”隔开

    //==================================================================================================================
    //查询
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询
     * 使用者：无限制
     *
     * URL：	
     *
     * 参数：
     * start     可选   记录开始位置
     * limit     可选   获取记录数量
     * autoId    可选   记录Id
     * nO        可选   编号(模糊匹配)
     * name      可选   名称(模糊匹配)
     * state     可选   记录状态：2正常、3关闭、4历史
     * orderO    可选   按编号排序：1从小到大、2从大到小
     * orderN    可选   按名称排序：1从小到大、2从大到小
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"total":"总记录数","dataList":[Term]}
     *
     */

	//==================================================================================================================
	// 修改
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：修改
	 * 使用者：
	 *
	 * URL：public/term!edit.action
	 *
	 * 参数
	 * autoId     必需   学期Id
	 * nO         可选   学期编号
	 * name       可选   学期名称
	 * startDate  可选   开学日期
	 * endDate    可选   结束日期
	 * firstMon   可选   首个周一日期
	 * weeks      可选   周数
	 * cur        可选   当前学期 1当前学期  2非当前学期(默认)
	 * remark     可选   备注
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 修改记录状态
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：修改记录状态
	 * 使用者：
	 *
	 * URL：public/term!chState.action
	 *
	 * 参数
	 * autoIds   必需   学期Id 多个用“,”隔开
	 * state    必需   状态值
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 删除
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：删除
	 * 使用者：
	 *
	 * URL：public/term!del.action
	 *
	 * 参数
	 * autoIds   必需   学期Id 多个用“,”隔开
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

    //==================================================================================================================
