/** 宿舍寝室 */

    /** 宿舍Id     */ private Integer autoId ;
    /** 编号       */ private String  nO     ;
    /** 名称       */ private String  name   ;
    /** 宿舍楼编号 */ private Integer buildCd; //T_Code.F_Type=1030
    /** 备注       */ private String  remark ;
    /** 状态       */ private Byte    state  ; //1草稿、2正常(默认)、3关闭、4历史

    /** 按编号排序 */ private Byte   orderO ;
    /** 按名称排序 */ private Byte   orderN ;
	/** 宿舍Id(组) */ private String autoIds; //多个用“,”隔开

    //==================================================================================================================
    // 查询
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询
     * 使用者：教师
     *
     * URL：public/dorm!query.action
     *
     * 参数：
     * start     可选   记录开始位置
     * limit     可选   获取记录数量
     * autoId    可选   记录Id
     * nO        可选   编号(模糊匹配)
     * name      可选   名称(模糊匹配)
     * buildCd   可选   宿舍楼编号
     * state     可选   记录状态  2正常、3关闭、4历史
     * orderO    可选   按编号排序：1从小到大、2从大到小
     * orderN    可选   按名称排序：1从小到大、2从大到小
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"total":"总记录数","dataList":[Dormitories]}
     *
     */

	//==================================================================================================================
	// 修改记录状态
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：修改记录状态
	 * 使用者：
	 *
	 * URL：public/dorm!chState.action
	 *
	 * 参数
	 * autoIds   必需   宿舍Id 多个用“,”隔开
	 * state    必需   状态值
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 删除
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：删除
	 * 使用者：
	 *
	 * URL：public/dorm!del.action
	 *
	 * 参数
	 * autoIds   必需   宿舍Id 多个用“,”隔开
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

	//==================================================================================================================
