/** 教室(场地) */

    /** 场地Id     */ private Integer autoId ;
    /** 场地编号   */ private String  nO     ;
    /** 场地名称   */ private String  name   ;
    /** 场地类型   */ private Integer type   ; //T_Code.F_Type = 46
    /** 教学楼     */ private Integer buiId  ;
    /** 部门       */ private Integer depId  ;
    /** 座位数     */ private Short   seatNum;
    /** 备注       */ private String  remark ;
	/** 并班系数   */ private Byte    merge  ;
    /** 记录状态   */ private Byte    state  ; //1草稿、2正常(默认)、3关闭、4历史
    /** 教学楼名称 */ private String  buiName;
    /** 部门名称   */ private String  depName;

    /** 按编号排序 */ private Byte   orderO ;
    /** 按名称排序 */ private Byte   orderN ;
	/** 场地Id(组) */ private String autoIds; //多个用“,”隔开

    //==================================================================================================================
    //查询
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询
     * 使用者：教师
     *
     * URL：public/claRom!query.action
     *
     * 参数：
     * start     可选   记录开始位置
     * limit     可选   获取记录数量
     * autoId    可选   场地Id
     * nO        可选   场地编号(模糊匹配)
     * name      可选   场地名称(模糊匹配)
     * type      可选   场地类型
     * buiId     可选   教学楼Id
     * depId     可选   部门Id
     * state     可选   记录状态  2正常、3关闭、4历史
     * orderO    可选   按编号排序：1从小到大、2从大到小
     * orderN    可选   按名称排序：1从小到大、2从大到小
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"total":"总记录数","dataList":[V_ClassRoom]}
     *
     */

    //==================================================================================================================
    // 查询2 -- 详细信息
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询2 -- 详细信息
     * 使用者：教师
     *
     * URL：public/claRom!query2.action
     *
     * 参数：
     * start     可选   记录开始位置
     * limit     可选   获取记录数量
     * autoId    可选   场地Id
     * nO        可选   场地编号(模糊匹配)
     * name      可选   场地名称(模糊匹配)
     * type      可选   场地类型
     * buiId     可选   教学楼Id
     * depId     可选   部门Id
     * state     可选   记录状态  2正常、3关闭、4历史
     * buiName   可选   教学楼名称(模糊匹配)
     * depName   可选   部门名称  (模糊匹配)
     * orderO    可选   按编号排序：1从小到大、2从大到小
     * orderN    可选   按名称排序：1从小到大、2从大到小
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"total":"总记录数","dataList":[V_ClassRoomExt.jsonOut]}
     *
     */

    //==================================================================================================================
    // 新增
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：新增
     * 使用者：高级用户
     *
     * URL：public/claRom!newRec.action
     *
     * 参数：
     * nO        可选   场地编号
     * name      必需   场地名称
     * type      可选   场地类型 T_Code.F_Type = 46
     * buiId     可选   教学楼
     * depId     可选   部门
     * seatNum   可选   座位数
     * remark    可选   备注
	 * merge     可选   并班系数
     * state     可选   记录状态 2正常(默认)、3关闭、4历史
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"newId":新记录Id,"message":"成功信息"}
     *
     */

    //==================================================================================================================
    // 修改
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：修改
     * 使用者：高级用户
     *
     * URL：public/claRom!edit.action
     *
     * 参数：
     * autoId    必需   记录Id
     * nO        可选   场地编号
     * name      可选   场地名称
     * type      可选   场地类型 T_Code.F_Type = 46
     * buiId     可选   教学楼
     * depId     可选   部门
     * seatNum   可选   座位数
     * remark    可选   备注
	 * merge     可选   并班系数
     * state     可选   记录状态 2正常、3关闭、4历史
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

	//==================================================================================================================
	// 修改记录状态
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：修改记录状态
	 * 使用者：
	 *
	 * URL：public/claRom!chState.action
	 *
	 * 参数
	 * autoIds   必需   场地Id 多个用“,”隔开
	 * state     必需   状态值
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 删除
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：删除
	 * 使用者：
	 *
	 * URL：public/claRom!del.action
	 *
	 * 参数
	 * autoIds   必需   场地Id 多个用“,”隔开
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

    //==================================================================================================================
