/** 教研组 */

    /** 教研组Id   */ private Integer autoId ;
    /** 编号       */ private String  nO     ;
    /** 名称       */ private String  name   ;
    /** 负责人     */ private Integer leader ;
    /** 备注       */ private String  remark ;
    /** 状态       */ private Byte    state  ;
    /** 负责人姓名 */ private String  lerName;

    /** 按编号排序   */ private Byte   orderO ;
    /** 按名称排序   */ private Byte   orderN ;
	/** 教研组Id(组) */ private String autoIds; //多个用“,”隔开

    //==================================================================================================================
    //查询 -- 基本信息
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询 -- 基本信息
     * 使用者：无限制
     *
     * URL：public/rsh!query.action
     *
     * 参数：
     * start     可选   记录开始位置
     * limit     可选   获取记录数量
     * autoId    可选   记录Id
     * nO        可选   编号(模糊匹配)
     * name      可选   名称(模糊匹配)
     * state     可选   记录状态：2正常、3关闭、4历史
     * orderO    可选   按编号排序：1从小到大、2从大到小
     * orderN    可选   按名称排序：1从小到大、2从大到小
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"total":"总记录数","dataList":[ResearchGroup]}
     *
     */

    //==================================================================================================================
    //查询 -- 详细信息
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询 -- 详细信息
     * 使用者：无限制
     *
     * URL：public/rsh!query2.action
     *
     * 参数：
     * start     可选   记录开始位置
     * limit     可选   获取记录数量
     * autoId    可选   记录Id
     * nO        可选   编号(模糊匹配)
     * name      可选   名称(模糊匹配)
     * state     可选   记录状态：2正常、3关闭、4历史
     * orderO    可选   按编号排序：1从小到大、2从大到小
     * orderN    可选   按名称排序：1从小到大、2从大到小
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"total":"总记录数","dataList":[V_ResearchGroup]}
     *
     */

    //==================================================================================================================
    // 新增
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：新增
     * 使用者：高级用户
     *
     * URL：public/rsh!newRec.action
     *
     * 参数：
     * nO        可选   教研组编号
     * name      必需   教研组名称
     * leader    可选   组长
     * remark    可选   备注
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"newId":新记录Id,"message":"成功信息"}
     *
     */

    //==================================================================================================================
    // 修改
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：修改
     * 使用者：高级用户(无限制)
     *
     * URL：public/rsh!edit.action
     *
     * 参数：
     * autoId    必需   记录Id
     * nO        可选   教研组编号
     * name      可选   教研组名称
     * leader    可选   组长
     * remark    可选   备注
     * state     可选   状态 (有效值：2有效、3关闭、4历史)
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

	//==================================================================================================================
	// 修改记录状态
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：修改记录状态
	 * 使用者：
	 *
	 * URL：public/rsh!chState.action
	 *
	 * 参数
	 * autoIds   必需   教研组Id 多个用“,”隔开
	 * state    必需   状态值
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 删除
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：删除
	 * 使用者：
	 *
	 * URL：public/rsh!del.action
	 *
	 * 参数
	 * autoIds   必需   教研组Id 多个用“,”隔开
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

    //==================================================================================================================
