/** 系统代码 */

    /** 代码类型 */ private Integer type  ;
    /** 代码     */ private Integer code  ;
    /** 编号     */ private String  nO    ;
    /** 名称     */ private String  name  ;
    /** 系数     */ private Double  ratio ;
    /** 备注     */ private String  remark;
    /** 有效     */ private Byte    state; //1有效(默认)  2无效

    /** 按编号排序 */ private Byte orderO;
    /** 按名称排序 */ private Byte orderN;
    /** 按系数排序 */ private Byte orderR;

    //==================================================================================================================
    //查询
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询
     * 使用者：无限制
     *
     * URL：public/code!query.action
     *
     * 参数：
     * start      可选   记录开始位置
     * limit      可选   获取记录数量
     * type       可选   代码类型
     * code       可选   代码
     * nO         可选   编号(模糊匹配)
     * name       可选   名称(模糊匹配)
     * state      可选   1有效 2无效
     * orderO     可选   按编号排序：1从小到大、2从大到小
     * orderN     可选   按名称排序：1从小到大、2从大到小
     * orderR     可选   按系数排序：1从小到大、2从大到小
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"total":"总记录数","dataList":[Code]}
     *
     */

	//==================================================================================================================
	// 获取某类代码的最大值+1
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：获取某类代码的最大值+1
	 * 使用者：
	 *
	 * URL：public/code!getNewCode.action
	 *
	 * 参数
	 * type   必需   分类
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：新代码
	 *
	 */

	//==================================================================================================================
	// 新增
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：新增
	 * 使用者：
	 *
	 * URL：public/code!newRec.action
	 *
	 * 参数
	 * type    必需   分类
	 * code    必需   代码，设置为0将获取当前最大code+1
	 * nO      可选   编码
	 * name    必需   名称
	 * ratio   可选   系数
	 * remark  可选   备注
	 * state   可选   是否有效 1有效(默认) 2无效
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功能信息","data":{Code}}
	 *
	 */

    //==================================================================================================================
    //修改
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：修改
     * 使用者：高级用户
     *
     * URL：public/code!edit.action
     *
     * 参数：
     * type       必需   代码类型
     * code       必需   代码
     * nO         可选   编号
     * name       可选   名称
     * ratio      可选   系数
     * remark     可选   备注
     * state      可选   1有效 2无效
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"删除成功"}
     *
     */

    //==================================================================================================================
