/** 部门教师 */

    /** 部门Id   */ private Integer depId   ;
    /** 教师Id   */ private Integer thrId   ;
    /** 任职类型 */ private Short   postType;
    /** 备注     */ private String  remark  ;
    /** 状态     */ private Byte    state   ; //2正常 4关闭
    /** 部门名称 */ private String  depName ;
    /** 教师编号 */ private String  thrNO   ;
    /** 教师姓名 */ private String  thrName ;

    /** 按部门名称排序 */ private Byte orderD;
    /** 按教师姓名排序 */ private Byte orderT;

    //==================================================================================================================
    //查询
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询
     * 使用者：无限制
     *
     * URL：public/depThr!query.action
     *
     * 参数：
     * start     可选   记录开始位置
     * limit     可选   获取记录数量
     * depId     可选   部门Id
     * thrId     可选   教师Id
     * postType  可选   任职类型
     * state     可选   记录状态：2正常、3关闭、4历史
     * depName   可选   部门名称(模糊匹配)
     * thrNO     可选   教师编号(模糊匹配)
     * thrName   可选   教师姓名(模糊匹配)
     * orderD    可选   按部门名称排序：1从小到大、2从大到小
     * orderN    可选   按教师姓名排序：1从小到大、2从大到小
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"total":"总记录数","dataList":[V_DepThr]}
     *
     */

    //==================================================================================================================
    // 查询我的部门
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询我的部门
     * 使用者：教师
     *
     * URL：public/depThr!myDep.action
     *
     * 参数：
     * postType   可选   任职类型：0所有类型(默认)、1普通成员、8负责人
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"data":[部门Id集]}
     *
     * 注：只返回正常状态的记录
     *
     */

    //==================================================================================================================
    // 新增
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：新增
     * 使用者：高级用户
     *
     * URL：public/depThr!newRec.action
     *
     * 参数：
     * depId     必需   部门Id
     * thrId     必需   教师Id
     * postType  可选   任职类型：1普通(默认) 2负责人
     * remark    可选   备注信息
     * state     可选   记录状态：2正常、3关闭、4历史
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,message:"成功信息"}
     *
     */

    //==================================================================================================================
    // 修改
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：修改
     * 使用者：高级用户
     *
     * URL：public/depThr!edit.action
     *
     * 参数：
     * depId      必需   学部Id
     * thrId      必需   教师Id
     * postType   可选   任职类型
     * remark     可选   备注
     * state      可选   状态 (有效值：2有效、3关闭、4历史)
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
    // 修改记录状态
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：修改记录状态
     * 使用者：高级用户
     *
     * URL：public/depThr!chState.action
     *
     * 参数：
     * depId    必需   部门Id
     * thrId    必需   教师Id
     * state    必需   新状态
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"状态修改成功！"}
     *
     */

    //==================================================================================================================
    //删除
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：删除
     * 使用者：高级用户
     *
     * URL：public/depThr!del.action
     *
     * 参数：
     * depId    必需   部门Id
     * thrId    必需   教师Id
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"删除成功"}
     *
     */

    //==================================================================================================================
