/** 部门 */

    /** 学部Id   */ private Integer autoId  ;
    /** 学部类型 */ private Integer type    ; //T_Code.F_Type=21
    /** 学部名称 */ private String  name    ;
    /** 学部电话 */ private String  phone   ;
    /** 主任     */ private Integer director;
    /** 部长     */ private Integer minister;
    /** 状态     */ private Byte    state   ; //1草稿、2正常(默认)、3关闭、4历史
    /** 主任姓名 */ private String  derName ;
    /** 部长姓名 */ private String  merName ;

    /** 按名称排序 */ private Byte   orderN ;
	/** 学部Id(组) */ private String autoIds; //多个用“,”隔开

    //==================================================================================================================
    //查询 -- 基本信息
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询 -- 基本信息
     * 使用者：无限制
     *
     * URL：public/dep!query.action
     *
     * 参数：
     * start     可选   记录开始位置
     * limit     可选   获取记录数量
     * autoId    可选   记录Id
     * type      可选   学部类型
     * name      可选   名称(模糊匹配)
     * state     可选   记录状态：2正常、3关闭、4历史
     * orderN    可选   按名称排序：1从小到大、2从大到小
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"total":"总记录数","dataList":[Department]}
     *
     */

    //==================================================================================================================
    //查询 -- 详细信息
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询 -- 详细信息
     * 使用者：无限制
     *
     * URL：public/dep!query2.action
     *
     * 参数：
     * start     可选   记录开始位置
     * limit     可选   获取记录数量
     * autoId    可选   记录Id
     * type      可选   学部类型
     * name      可选   名称(模糊匹配)
     * state     可选   记录状态：2正常、3关闭、4历史
     * orderN    可选   按名称排序：1从小到大、2从大到小
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"total":"总记录数","dataList":[V_DepartmentExt.jsonOut]}
     *
     */

	//==================================================================================================================
	// 修改记录状态
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：修改记录状态
	 * 使用者：
	 *
	 * URL：public/dep!chState.action
	 *
	 * 参数
	 * autoIds   必需   学部Id 多个用“,”隔开
	 * state    必需   状态值
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 删除
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：删除
	 * 使用者：
	 *
	 * URL：public/dep!del.action
	 *
	 * 参数
	 * autoIds   必需   学部Id 多个用“,”隔开
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

    //==================================================================================================================
