/** 时段模板明细 */

    /** 时段模板Id   */ private Integer modId       ;
    /** 时段开始时间 */ private Time    startTime   ;
    /** 时段时长(秒) */ private Integer timeLong    ;
    /** 对应开始节次 */ private Byte    startSection;
    /** 对应结束节次 */ private Byte    endSection  ;

    /** 排序字段 */ private String[] orderFd; //排序字段的名称，倒序前面加“@”，可以多个

    //==================================================================================================================
    // 查询
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询
     * 使用者：
     *
     * URL：timeModelD!query.action
     *
     * 参数
     * start         可选   记录开始位置
     * limit         可选   获取记录数量
     * modId         可选   时段模板Id
     * timeLong      可选   时段时长(秒)
     * startSection  可选   对应开始节次
     * endSection    可选   对应结束节次
     * orderFd       可选   排序字段的字段名称，倒序前面加“@”
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"total":"总记录数","dataList":[TimeModelD]}
     *
     */

    //==================================================================================================================
    // 新增
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：新增
     * 使用者：教师
     *
     * URL：timeModelD!newRec.action
     *
     * 参数
     * modId         必需   时段模板Id
     * startTime     必需   时段开始时间
     * timeLong      必需   时段时长(秒)
     * startSection  可选   对应开始节次
     * endSection    可选   对应结束节次
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"data":{TimeModelD}}
     *
     */

    //==================================================================================================================
    // 修改
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：新增
     * 使用者：教师
     *
     * URL：timeModelD!edit.action
     *
     * 参数
     * modId         必需   时段模板Id
     * startTime     必需   时段开始时间
     * timeLong      必需   时段时长(秒)
     * startSection  可选   对应开始节次
     * endSection    可选   对应结束节次
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
    // 删除
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：删除
     * 使用者：教师
     *
     * URL：timeModelD!del.action
     *
     * 参数
     * modId       必需   时段模板Id
     * startTime   必需   时段开始时间
     * timeLong    必需   时段时长(秒)
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
