/** 监考人员库 */

    /** 监考员Id   */ private Integer autoId  ;
    /** 考试批次Id */ private Integer batId   ;
    /** 教师Id     */ private Integer thrId   ;
    /** 监考下限   */ private Byte    timesLow;
    /** 监考上限   */ private Byte    timesMax;
    /** 已排场次   */ private Byte    times   ;
    /** 监考类型   */ private Byte    type    ; //T_Code.F_Type=51 1主监考、2副监考、3巡考
    /** 教师编号   */ private String  thrNO   ;
    /** 教师姓名   */ private String  thrName ;
    /** 教师性别   */ private String  thrSex  ;

    /** 排序字段 */ private String[] orderFd; //排序字段的名称，倒序前面加“@”，可以多个

    //==================================================================================================================
    // 查询 -- 基本信息
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询 -- 基本信息
     * 使用者：
     *
     * URL：proctorLib!query.action
     *
     * 参数
     * start     可选   记录开始位置
     * limit     可选   获取记录数量
     * autoId    可选   监考员Id
     * batId     可选   考试批次Id
     * thrId     可选   教师Id
     * timesLow  可选   监考下限
     * timesMax  可选   监考上限
     * times     可选   已排场次
     * type      可选   监考类型 T_Code.F_Type=51 1主监考、2副监考、3巡考
     * orderFd   可选   排序字段的字段名称，倒序前面加“@”
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"total":"总记录数","dataList":[ProctorLib]}
     *
     */

    //==================================================================================================================
    // 查询2 -- 详细信息
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询2 -- 详细信息
     * 使用者：所有用户
     *
     * URL：proctorLib!query2.action
     *
     * 参数
     * start     可选   记录开始位置
     * limit     可选   获取记录数量
     * autoId    可选   监考员Id
     * batId     可选   考试批次Id
     * thrId     可选   教师Id
     * timesLow  可选   监考下限
     * timesMax  可选   监考上限
     * times     可选   已排场次
     * type      可选   监考类型 T_Code.F_Type=51 1主监考、2副监考、3巡考
     * thrNO     可选   教师编号
     * thrName   可选   教师姓名
     * thrSex    可选   教师性别
     * orderFd   可选   排序字段的字段名称，倒序前面加“@”
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"total":"总记录数","dataList":[V_ProctorLib]}
     *
     */

    //==================================================================================================================
    // 新增
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：新增
     * 使用者：教师
     *
     * URL：proctorLib!newRec.action
     *
     * 参数
     * batId     必需   考试批次Id
     * thrId     必需   教师Id
     * timesLow  可选   监考下限
     * timesMax  可选   监考上限
     * times     可选   已排场次
     * type      可选   监考类型 T_Code.F_Type=51 1主监考(默认)、2副监考、3巡考
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"data":{ProctorLib}}
     *
     */

    //==================================================================================================================
    // 修改
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：修改
     * 使用者：教师
     *
     * URL：proctorLib!edit.action
     *
     * 参数
     * autoId    必需   监考员Id
     * batId     可选   考试批次Id
     * thrId     可选   教师Id
     * timesLow  可选   监考下限
     * timesMax  可选   监考上限
     * times     可选   已排场次
     * type      可选   监考类型 T_Code.F_Type=51 1主监考、2副监考、3巡考
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
    // 删除
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：删除
     * 使用者：教师
     *
     * URL：proctorLib!del.action
     *
     * 参数
     * autoId    必需   监考员Id
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
    // 重新统计监考员的“已排场次”
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：重新统计监考员的“已排场次”
     * 使用者：教师
     *
     * URL：proctorLib!totalTimes.action
     *
     * 参数
     * prtIds   3选1   监考员Id    多个Id用“,”隔开
     * batIds   3选1   排考批次Id  多个Id用“,”隔开
     * planId   3选1   排考计划Id
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */
    
    //==================================================================================================================
