/** 监考教师 */

    /** 排考Id     */ private Integer arrId     ;
    /** 监考员Id   */ private Integer prtId     ;
    /** 监考教师Id */ private Integer thrId     ;
    /** 监考类型   */ private Byte    type      ; //T_Code.F_Type=51 1主监考、2副监考、3巡考
    /** 教师编号   */ private String  thrNO     ;
    /** 教师姓名   */ private String  thrName   ;
    /** 教师性别   */ private String  thrSex    ;
    /** 考试批次Id */ private Integer batId     ;
    /** 考试时段Id */ private Integer timeId    ;
    /** 考场Id     */ private Integer roomId    ;
    /** 时段名称   */ private String  timeName  ;
    /** 场地Id     */ private Integer claRomId  ;
    /** 场地名称   */ private String  claromName;
    /** 考试班Id   */ private String  exmClaId  ;
    /** 考试班名称 */ private String  exmClaName;

    /** 排序字段 */ private String[] orderFd; //排序字段的名称，倒序前面加“@”，可以多个

    //==================================================================================================================
    // 查询
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询
     * 使用者：
     *
     * URL：examPro!query.action
     *
     * 参数
     * start    可选   记录开始位置
     * limit    可选   获取记录数量
     * arrId    可选   排考Id
     * prtId    可选   监考员Id
     * thrId    可选   监考教师Id
     * type     可选   监考类型 T_Code.F_Type=51 1主监考、2副监考、3巡考
     * orderFd  可选   排序字段的字段名称，倒序前面加“@”
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"total":"总记录数","dataList":[ExamProctor]}
     *
     */

	//==================================================================================================================
	// 查询2 -- 详细信息
    //------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：查询2 -- 详细信息
	 * 使用者：教师
	 *
	 * URL：examPro!query.action
	 *
	 * 参数
	 * start     可选   记录开始位置
	 * limit     可选   获取记录数量
	 * arrId     可选   排考Id
	 * prtId     可选   监考员Id
	 * thrId     可选   监考教师Id
	 * arrType   可选   实际监考类型
	 * timesLow  可选   监考下限
	 * timesMax  可选   监考上限
	 * times     可选   已排场次
	 * type      可选   预设监考类型
	 * thrNO     可选   教师编号
	 * thrName   可选   教师姓名
	 * thrSex    可选   教师性别
	 * thrDepId  可选   教师学部Id
	 * thrRshId  可选   教师教研组Id
	 * batId     可选   考试批次Id
	 * timeId    可选   考试时段Id
	 * exmRomId  可选   考场Id
	 * orderFd   可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"total":"总记录数","dataList":[V_ExamProctor]}
	 *
	 */

    //==================================================================================================================
    // 查询4 -- 详细信息[+教师姓名+详细排考信息]
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询4 -- 详细信息[+教师姓名+详细排考信息]
     * 使用者：教师
     *
     * URL：examPro!query4.action
     *
     * 参数
     * start       可选   记录开始位置
     * limit       可选   获取记录数量
     * arrId       可选   排考Id
     * prtId       可选   监考员Id
     * thrId       可选   监考教师Id
     * type        可选   监考类型 T_Code.F_Type=51 1主监考、2副监考、3巡考
     * thrNO       可选   教师编号
     * thrName     可选   教师姓名
     * thrSex      可选   教师性别
     * batId       可选   考试批次Id
     * timeId      可选   考试时段Id
     * orderFd     可选   排序字段的字段名称，倒序前面加“@”
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"total":"总记录数","dataList":[V_ExamProctor4]}
     *
     */

    //==================================================================================================================
    // 报表 -- 监考员(天数/午别数)
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：报表 -- 监考员(天数/午别数)
     * 使用者：教师
     *
     * URL：examPro!report.action
     *
     * 参数
     * arrId     可选   排考Id
     * prtId     可选   监考员Id
     * thrId     可选   监考教师Id
     * type      可选   监考类型
     * batId     可选   考试批次Id
     * timeId    可选   考试时段Id
     * planId    可选   考试计划Id
     * timeName  可选   时段名称
     * thrNO     可选   教师编号
     * thrName   可选   教师姓名
     * thrSex    可选   教师性别
     * orderFd   可选   排序字段的字段名称，倒序前面加“@”
     * 
     * 注意：关于“天数/午别数”，只对查询结果进行统计
     * 注意：可排序的字段，请参考返回的字段
     * 
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"total":"总记录数","dataList":[R_ExamProctor]}
     *
     */
    
    //==================================================================================================================
    // 新增
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：新增
     * 使用者：高级用户
     *
     * URL：examPro!newRec.action
     *
     * 参数
     * arrId  必需   排考Id
     * prtId  必需   监考员Id
     * type   可选   监考类型 T_Code.F_Type=51 1主监考、2副监考、3巡考
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"data":{ExamProctor}}
     *
     * 注意：这里不检查冲突
     *
     */

    //==================================================================================================================
    // 修改
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：修改
     * 使用者：高级用户
     *
     * URL：examPro!edit.action
     *
     * 参数
     * arrId  必需   排考Id
     * prtId  必需   监考员Id
     * type   可选   监考类型 T_Code.F_Type=51 1主监考、2副监考、3巡考
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
    // 删除
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：删除
     * 使用者：高级用户
     *
     * URL：examPro!del.action
     *
     * 参数
     * arrId  必需   排考Id
     * prtId  必需   监考员Id
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
