/** 考场库 */

    /** 考场Id     */ private Integer autoId     ;
    /** 考试批次Id */ private Integer batId      ;
    /** 场地Id     */ private Integer roomId     ;
    /** 绑定行政班 */ private Integer bindClaId  ; //默认0表示不绑定，大于0为行政班Id
    /** 座位数量   */ private Short   seatNum    ;
    /** 并班系数   */ private Byte    merge      ; //1不允许并班(默认)，大于2为最多允许几个班，最大99
    /** 场地编号   */ private String  roomNO     ;
    /** 场地名称   */ private String  roomName   ;
    /** 教室类型   */ private Integer roomType   ;
    /** 教学楼     */ private Integer buiId      ;
    /** 所属部门   */ private Integer depId      ;
    /** 班级编号   */ private String  bindClaNO  ;
    /** 班级名称   */ private String  bindClaName;
    /** 教学楼编号 */ private String  buiNO      ;
    /** 教学楼名称 */ private String  buiName    ;
    /** 校区Id     */ private Integer camId      ;
    /** 校区编号   */ private String  camNO      ;
    /** 校区名称   */ private String  camName    ;
    /** 学部名称   */ private String  depName    ;

    /** 排序字段 */ private String[] orderFd; //排序字段的名称，倒序前面加“@”，可以多个

    //==================================================================================================================
    // 查询
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询
     * 使用者：
     *
     * URL：examRoomLib!query.action
     *
     * 参数
     * start      可选   记录开始位置
     * limit      可选   获取记录数量
     * autoId     可选   考场Id
     * batId      可选   考试批次Id
     * roomId     可选   场地Id
     * bindClaId  可选   绑定行政班 默认0表示不绑定，大于0为行政班Id
     * seatNum    可选   座位数量
     * merge      可选   并班系数 1不允许并班(默认)，大于2为最多允许几个班，最大99
     * orderFd    可选   排序字段的字段名称，倒序前面加“@”
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"total":"总记录数","dataList":[ExamRoomLib]}
     *
     */

    //==================================================================================================================
    // 查询2 - 详细信息
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询2 - 详细信息
     * 使用者：所有用户
     *
     * URL：examRoomLib!query2.action
     *
     * 参数
     * start        可选   记录开始位置
     * limit        可选   获取记录数量
     * autoId       可选   考场Id
     * batId        可选   考试批次Id
     * roomId       可选   场地Id
     * bindClaId    可选   绑定行政班 默认0表示不绑定，大于0为行政班Id
     * seatNum      可选   座位数量
     * merge        可选   并班系数 1不允许并班(默认)，大于2为最多允许几个班，最大99
     * roomNO       可选   场地编号
     * roomName     可选   场地名称
     * roomType     可选   教室类型
     * buiId        可选   教学楼
     * depId        可选   所属部门
     * bindClaNO    可选   班级编号
     * bindClaName  可选   班级名称
     * buiNO        可选   教学楼编号
     * buiName      可选   教学楼名称
     * camId        可选   校区Id
     * camNO        可选   校区编号
     * camName      可选   校区名称
     * depName      可选   学部名称
     * orderFd      可选   排序字段的字段名称，倒序前面加“@”
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"total":"总记录数","dataList":[V_ExamRoomLib]}
     *
     */

    //==================================================================================================================
    // 新增
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：新增
     * 使用者：教师
     *
     * URL：examRoomLib!newRec.action
     *
     * 参数
     * batId      必需   考试批次Id
     * roomId     必需   场地Id(教室Id)
     * bindClaId  可选   绑定行政班 默认0表示不绑定，大于0为行政班Id
     * seatNum    可选   座位数量 -- 没有指定将自动取用场地的座位数
     * merge      可选   并班系数 1不允许并班(默认)，大于2为最多允许几个班，最大99
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"data":{ExamRoomLib}}
     *
     */

    //==================================================================================================================
    // 复制考场库
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：复制考场库
     * 使用者：高级用户
     *
     * URL：examRoomLib!copy.action
     *
     * 参数
     * batId     必需   接收复制的考试批次Id
     * batId2    必需   被复制的考试批次Id
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":成功信息}
     *
     */

    //==================================================================================================================
    // 初始绑定考场：根据已有考试任务 + 班级绑定场地(考场) --初始创建--> 考场 + 教学班指定考场
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：初始绑定考场：根据已有考试任务 + 班级绑定场地(考场) --初始创建--> 考场 + 教学班指定考场
     * 使用者：高级用户
     *
     * URL：examRoomLib!iniExmRom.action
     *
     * 参数
     * batId     必需   考试批次Id
     * taskIds   可选   考试任务Id(多个) -- 如果不指定该参数，则考试批次下的所有相关班级都会被初始指定考场
     *
     * 注意1：taskIds 必需属于指定的 batId，否则无效
     * 注意2：不会变更(或删除)任何原先已存在的记录
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
    // 修改
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：修改
     * 使用者：教师
     *
     * URL：examRoomLib!edit.action
     *
     * 参数
     * autoId     必需   考场Id
     * batId      可选   考试批次Id
     * roomId     可选   场地Id
     * bindClaId  可选   绑定行政班 默认0表示不绑定，大于0为行政班Id
     * seatNum    可选   座位数量
     * merge      可选   允许并班 1不允许并班(默认)、2允许并班
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
    // 删除
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：删除
     * 使用者：教师
     *
     * URL：examRoomLib!del.action
     *
     * 参数
     * autoId     必需   考场Id
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
