/** 出卷人信息 */

    /** 考卷Id     */ private Integer paperId ;
    /** 教师Id     */ private Integer thrId   ;
    /** 任职类型   */ private Byte    postType; //1=普通成员(默认)、2负责人
    /** 考试批次Id */ private Integer batId   ;
    /** 课程Id     */ private Integer couId   ;
    /** 考卷名称   */ private String  pprName ;
    /** 教师编号   */ private String  thrNO   ;
    /** 教师姓名   */ private String  thrName ;
    /** 教师性别   */ private String  thrSex  ;

    /** 排序字段 */ private String[] orderFd; //排序字段的名称，倒序前面加“@”，可以多个

    //==================================================================================================================
    // 查询
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询
     * 使用者：
     *
     * URL：pprAuthor!query.action
     *
     * 参数
     * start     可选   记录开始位置
     * limit     可选   获取记录数量
     * paperId   可选   考卷Id
     * thrId     可选   教师Id
     * postType  可选   任职类型 1=普通成员(默认)、2负责人
     * orderFd   可选   排序字段的字段名称，倒序前面加“@”
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"total":"总记录数","dataList":[PaperAuthor]}
     *
     */

    //==================================================================================================================
    // 查询2 -- 详细信息
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询2 -- 详细信息
     * 使用者：教师
     *
     * URL：pprAuthor!query2.action
     *
     * 参数
     * start     可选   记录开始位置
     * limit     可选   获取记录数量
     * paperId   可选   考卷Id
     * thrId     可选   教师Id
     * postType  可选   任职类型 1=普通成员(默认)、2负责人
     * batId     可选   考试批次Id
     * couId     可选   课程Id
     * pprName   可选   考卷名称
     * thrNO     可选   教师编号
     * thrName   可选   教师姓名
     * thrSex    可选   教师性别
     * orderFd   可选   排序字段的字段名称，倒序前面加“@”
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"total":"总记录数","dataList":[V_PaperAuthor]}
     *
     */

    //==================================================================================================================
    // 新增
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：新增
     * 使用者：高级用户
     *
     * URL：pprAuthor!newRec.action
     *
     * 参数
     * paperId   必需   考卷Id
     * thrId     必需   教师Id
     * postType  可选   任职类型 1=普通成员(默认)、2负责人
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
    // 修改
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：修改 -- 就只能改个任职类型
     * 使用者：高级用户
     *
     * URL：pprAuthor!edit.action
     *
     * 参数
     * paperId   必需   考卷Id
     * thrId     必需   教师Id
     * postType  必需   任职类型 1=普通成员(默认)、2负责人
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
    // 删除
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：删除
     * 使用者：高级用户
     *
     * URL：pprAuthor!del.action
     *
     * 参数
     * paperId   必需   考卷Id
     * thrId     必需   教师Id
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
