import java.sql.Date;

/** 考试时段 */

    /** 考试时段Id   */ private Integer   autoId      ;
    /** 考试批次Id   */ private Integer   batId       ;
    /** 时段名称     */ private String    name        ;
    /** 时段开始时间 */ private Timestamp startTime   ;
    /** 时段时长(秒) */ private Integer   timeLong    ;
    /** 对应教学周次 */ private Byte      termWeek    ;
    /** 对应开始节次 */ private Byte      startSection;
    /** 对应结束节次 */ private Byte      endSection  ;
    /** 记录状态     */ private Byte      state       ; // 2正常(默认)、3关闭、4历史

    /** 排序字段       */ private String[] orderFd  ; //排序字段的名称，倒序前面加“@”，可以多个
    /** 时段模板Id     */ private Integer  timeModId;
    /** 时段日期(多个) */ private Date[]   dates    ;

    //==================================================================================================================
    // 查询
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询
     * 使用者：
     *
     * URL：examTime!query.action
     *
     * 参数
     * start         可选   记录开始位置
     * limit         可选   获取记录数量
     * autoId        可选   考试时段Id
     * batId         可选   考试批次Id
     * name          可选   时段名称
     * timeLong      可选   时段时长
     * termWeek      可选   对应教学周次
     * startSection  可选   对应开始节次
     * endSection    可选   对应结束节次
     * state         可选   记录状态  2正常(默认)、3关闭、4历史
     * orderFd       可选   排序字段的字段名称，倒序前面加“@”
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"total":"总记录数","dataList":[ExamTime]}
     *
     */

    //==================================================================================================================
    // 初始考试时段：时段模板 + 考试计划(批次) --> 考试时段
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：初始考试时段：时段模板 + 考试计划(批次) --> 考试时段
     * 使用者：高级用户
     *
     * URL：examTime!ini.action
     *
     * 参数
     * batId       必需   考试批次Id
     * timeModId   必需   时段模板Id
     * dates       可选   初始指定的日期，没有指定日期将取用考试批次中的日期设置
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":成功信息}
     *
     */

    //==================================================================================================================
    // 新增
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：新增
     * 使用者：教师
     *
     * URL：examTime!newRec.action
     *
     * 参数
     * batId         必需   考试批次Id
     * name          可选   时段名称
     * startTime     必需   时段开始时间
     * timeLong      必需   时段时长
     * termWeek      可选   对应教学周次 -- 没有将进行自动计算
     * startSection  可选   对应开始节次 -- 没有将进行自动计算
     * endSection    可选   对应结束节次 -- 没有将进行自动计算
     * state         可选   记录状态  2正常(默认)、3关闭、4历史
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"data":{ExamTime}}
     *
     */

    //==================================================================================================================
    // 修改
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：修改
     * 使用者：教师
     *
     * URL：examTime!edit.action
     *
     * 参数
     * autoId        必需   考试时段Id
     * batId         可选   考试批次Id
     * name          可选   时段名称
     * startTime     可选   时段开始时间
     * timeLong      可选   时段时长
     * termWeek      可选   对应教学周次
     * startSection  可选   对应开始节次
     * endSection    可选   对应结束节次
     * state         可选   记录状态  2正常(默认)、3关闭、4历史
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
    // 删除
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：删除
     * 使用者：教师
     *
     * URL：examTime!del.action
     *
     * 参数
     * autoId   必需   考试时段Id
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
