/** 考试班 */

    /** 考试班Id   */ private Integer autoId      ;
    /** 考试批次Id */ private Integer batId       ;
    /** 考试任务Id */ private Integer taskId      ;
    /** 考试班名称 */ private String  name        ;
    /** 绑定行政班 */ private Integer bindClaId   ; //默认0表示不绑定，大于0为行政班Id
    /** 考生人数   */ private Short   examStuNum  ;
    /** 排考Id     */ private Integer arrId       ;
    /** 考卷Id     */ private Integer paperId     ;
    /** 备注       */ private String  remark      ;
    /** 记录状态   */ private Byte    state       ; // 2正常(默认)、3关闭、4历史
    /** 考试计划Id */ private Integer planId      ;
    /** 考试类型   */ private Integer examType    ; //T_Code.F_Type=48 1期中考试、2期末考试、3月考、4会考、5高考
    /** 批次名称   */ private String  batName     ;
    /** 班级类型   */ private Byte    bindClaType ;
    /** 班级编号   */ private String  bindClaNO   ;
    /** 班级名称   */ private String  bindClaName ;
    /** 年级代码   */ private Integer bindClaGrade;
    /** 专业代码   */ private Integer bindClaMajor;
    /** 校区Id     */ private Integer bindClaCamId;

    /** 排序字段         */ private String[] orderFd; //排序字段的名称，倒序前面加“@”，可以多个
    /** 考试任务Id(多个) */ private int[]    taskIds;
    /** 类型区分         */ private Byte     type   ;

    //==================================================================================================================
    // 查询
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询
     * 使用者：
     *
     * URL：examCla!query.action
     *
     * 参数
     * start       可选   记录开始位置
     * limit       可选   获取记录数量
     * autoId      可选   考试班Id
     * batId       可选   考试批次Id
     * taskId      可选   考试任务Id
     * name        可选   考试班名称
     * bindClaId   可选   绑定行政班 默认0表示不绑定，大于0为行政班Id
     * examStuNum  可选   考生人数
     * arrId       可选   排考Id(-1代表没排考记录)
     * paperId     可选   考卷Id
     * remark      可选   备注
     * state       可选   记录状态  2正常(默认)、3关闭、4历史
     * orderFd     可选   排序字段的字段名称，倒序前面加“@”
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"total":"总记录数","dataList":[ExamClass]}
     *
     */

    //==================================================================================================================
    // 查询2 -- 详细信息
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询 -- 详细信息
     * 使用者：教师
     *
     * URL：examCla!query2.action
     *
     * 参数
     * start         可选   记录开始位置
     * limit         可选   获取记录数量
     * autoId        可选   考试班Id
     * batId         可选   考试批次Id
     * taskId        可选   考试任务Id
     * name          可选   考试班名称
     * bindClaId     可选   绑定行政班 默认0表示不绑定，大于0为行政班Id
     * examStuNum    可选   考生人数
     * arrId         可选   排考Id(-1代表没排考记录)
     * paperId       可选   考卷Id
     * remark        可选   备注
     * state         可选   记录状态  2正常(默认)、3关闭、4历史
     * planId        可选   考试计划Id
     * examType      可选   考试类型 T_Code.F_Type=48 1期中考试、2期末考试、3月考、4会考、5高考
     * batName       可选   批次名称
     * bindClaType   可选   班级类型
     * bindClaNO     可选   班级编号
     * bindClaName   可选   班级名称
     * bindClaGrade  可选   年级代码
     * bindClaMajor  可选   专业代码
     * bindClaCamId  可选   校区Id
     * orderFd       可选   排序字段的字段名称，倒序前面加“@”
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"total":"总记录数","dataList":[V_ExamClass]}
     *
     */

    //==================================================================================================================
    // 查询3
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询3
     * 使用者：教师
     *
     * URL：examCla!query3.action
     *
     * 参数
     * start       可选   记录开始位置
     * limit       可选   获取记录数量
     * autoId      可选   考试班Id
     * batId       可选   考试批次Id
     * taskId      可选   考试任务Id
     * name        可选   考试班名称
     * bindClaId   可选   绑定行政班 默认0表示不绑定，大于0为行政班Id
     * examStuNum  可选   考生人数
     * arrId       可选   排考Id(-1代表没排考记录)
     * paperId     可选   考卷Id
     * remark      可选   备注
     * state       可选   记录状态  2正常(默认)、3关闭、4历史
     * couId       可选   课程Id
     * claId       可选   班级Id
     * pprName     可选   考卷名称
     * orderFd     可选   排序字段的字段名称，倒序前面加“@”
     * rtnThrInf   可选   1=返回教师信息，默认不返回教师信息
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"total":"总记录数","dataList":[V_ExamClass3]}
     *
     */

    //==================================================================================================================
    // 初始考试班：考试任务 --> 根据拆班系数 --> 生成考试班
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：初始考试班：考试任务 --> 根据拆班系数 --> 生成考试班
     * 使用者：高级用户
     *
     * URL：examCla!ini.action
     *
     * 参数
     * taskIds   2选1   考试任务Id(可多个)
     * batId     2选1   考试批次Id -- 如果存在taskIds参数，则忽略该参数
     * type      可选   考生分配到考试班：1=自动分配，2=不分配；默认只对拆班系数为1的进行考生分配
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":成功信息}
     *
     * 说明：已经存在“考试班”的“考试任务”不参与初始操作
     *
     */

    //==================================================================================================================
    // 新增
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：新增
     * 使用者：高级用户
     *
     * URL：examCla!newRec.action
     *
     * 参数
     * taskId      必需   考试任务Id
     * name        必需   考试班名称
     * bindClaId   可选   绑定行政班 默认0表示不绑定，大于0为行政班Id
     * examStuNum  可选   考生人数
     * arrId       可选   排考Id
     * paperId     可选   考卷Id
     * remark      可选   备注
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"data":{ExamClass}}
     *
     */

    //==================================================================================================================
    // 修改
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：修改
     * 使用者：高级用户
     *
     * URL：examCla!edit.action
     *
     * 参数
     * autoId      必需   考试班Id
     * name        可选   考试班名称
     * bindClaId   可选   绑定行政班 默认0表示不绑定，大于0为行政班Id
     * examStuNum  可选   考生人数
     * arrId       可选   排考Id
     * paperId     可选   考卷Id
     * remark      可选   备注
     * state       可选   记录状态  2正常(默认)、3关闭、4历史
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
    // 设置 或 删除 排考Id
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：设置 或 删除 排考Id
     * 使用者：高级用户
     *
     * URL：examCla!setArrId.action
     *
     * 参数
     * autoId      必需   考试班Id
     * arrId       可选   排考Id：大于0代表设置排考Id，否则将删除原有的排考Id
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */
    
    //==================================================================================================================
    // 删除
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：删除
     * 使用者：高级用户
     *
     * URL：examCla!del.action
     *
     * 参数
     * autoId   必需   考试班Id
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
