import java.sql.Timestamp;

/** 考试批次 */

    /** 考试批次Id           */ private Integer   autoId        ;
    /** 考试计划Id           */ private Integer   planId        ;
    /** 考试类型             */ private Integer   examType      ; //T_Code.F_Type=48 1期中考试、2期末考试、3月考、4会考、5高考
    /** 批次名称             */ private String    name          ;
    /** 开始时间             */ private Timestamp startTime     ;
    /** 结束时间             */ private Timestamp endTime       ;
    /** 开放查询时间         */ private Timestamp queryTime     ;
    /** 是否判断上课冲突     */ private Byte      thrCouConflict; //1不判断(默认)、2判断
    /** 是否判断其它批次冲突 */ private Byte      othConflict   ; //1不判断(默认)、2判断
    /** 备注                 */ private String    remark        ;
    /** 状态                 */ private Byte      state         ; // 2正常(默认)、3关闭、4历史
    /** 计划名称             */ private String    planName      ;
    /** 学期Id               */ private Integer   termId        ;
    /** 学期名称             */ private String    termName      ;

    /** 排序字段 */ private String[] orderFd; //排序字段的名称，倒序前面加“@”，可以多个

    //==================================================================================================================
    // 查询
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询
     * 使用者：教师
     *
     * URL：examBat!query.action
     *
     * 参数
     * start           可选   记录开始位置
     * limit           可选   获取记录数量
     * autoId          可选   考试批次Id
     * planId          可选   考试计划Id
     * examType        可选   考试类型 T_Code.F_Type=48 1期中考试、2期末考试、3月考、4会考、5高考
     * name            可选   批次名称
     * thrCouConflict  可选   是否判断上课冲突 1不判断(默认)、2判断
     * othConflict     可选   是否判断其它批次冲突 1不判断(默认)、2判断
     * remark          可选   备注
     * state           可选   状态  2正常(默认)、3关闭、4历史
     * orderFd         可选   排序字段的字段名称，倒序前面加“@”
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"total":"总记录数","dataList":[ExamBatch]}
     *
     */

    //==================================================================================================================
    // 查询2 -- 详细信息
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询2 -- 详细信息
     * 使用者：教师
     *
     * URL：examBat!query2.action
     *
     * 参数
     * start           可选   记录开始位置
     * limit           可选   获取记录数量
     * autoId          可选   考试批次Id
     * planId          可选   考试计划Id
     * examType        可选   考试类型 T_Code.F_Type=48 1期中考试、2期末考试、3月考、4会考、5高考
     * name            可选   批次名称
     * thrCouConflict  可选   是否判断上课冲突 1不判断(默认)、2判断
     * othConflict     可选   是否判断其它批次冲突 1不判断(默认)、2判断
     * remark          可选   备注
     * state           可选   状态  2正常(默认)、3关闭、4历史
     * planName        可选   计划名称
     * termId          可选   学期Id
     * termName        可选   学期名称
     * orderFd         可选   排序字段的字段名称，倒序前面加“@”
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"total":"总记录数","dataList":[V_ExamBatch]}
     *
     */

    //==================================================================================================================
    // 新增
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：新增
     * 使用者：教师
     *
     * URL：examBat!newRec.action
     *
     * 参数
     * planId          必需   考试计划Id
     * examType        必需   考试类型 T_Code.F_Type=48 1期中考试、2期末考试、3月考、4会考、5高考
     * name            必需   批次名称
     * startTime       必需   开始时间
     * endTime         必需   结束时间
     * queryTime       可选   开放查询时间
     * thrCouConflict  可选   是否判断上课冲突 1不判断(默认)、2判断
     * othConflict     可选   是否判断其它批次冲突 1不判断(默认)、2判断
     * remark          可选   备注
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"data":{ExamBatch}}
     *
     */

    //==================================================================================================================
    // 修改
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：新增
     * 使用者：教师
     *
     * URL：examBat!edit.action
     *
     * 参数
     * autoId          必需   考试批次Id
     * planId          可选   考试计划Id
     * examType        可选   考试类型 T_Code.F_Type=48 1期中考试、2期末考试、3月考、4会考、5高考
     * name            可选   批次名称
     * startTime       可选   开始时间
     * endTime         可选   结束时间
     * queryTime       可选   开放查询时间
     * thrCouConflict  可选   是否判断上课冲突 1不判断(默认)、2判断
     * othConflict     可选   是否判断其它批次冲突 1不判断(默认)、2判断
     * remark          可选   备注
     * state           可选   状态  2正常(默认)、3关闭、4历史
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
    // 删除
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：删除
     * 使用者：高级用户
     *
     * URL：examBat!del.action
     *
     * 参数
     * autoId  必需   考试批次Id
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
