/** 考试计划 */

    /** 考试计划Id */ private Integer autoId;
    /** 学期Id     */ private Integer termId;
    /** 计划名称   */ private String  name  ;
    /** 备注       */ private String  remark;
    /** 状态       */ private Byte    state ; // 2正常(默认)、3关闭、4历史
    /** 学期名称   */ private String  termNm;

    /** 排序字段 */ private String[] orderFd; //排序字段的名称，倒序前面加“@”，可以多个

    //==================================================================================================================
    // 查询
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询
     * 使用者：
     *
     * URL：examPlan!query.action
     *
     * 参数
     * start    可选   记录开始位置
     * limit    可选   获取记录数量
     * autoId   可选   考试计划Id
     * termId   可选   学期Id
     * name     可选   计划名称
     * remark   可选   备注
     * state    可选   状态  2正常(默认)、3关闭、4历史
     * orderFd  可选   排序字段的字段名称，倒序前面加“@”
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"total":"总记录数","dataList":[ExamPlan]}
     *
     */

    //==================================================================================================================
    // 新增
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：新增
     * 使用者：教师
     *
     * URL：examPlan!newRec.action
     *
     * 参数
     * termId  必需   学期Id
     * name    必需   计划名称
     * remark  可选   备注
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"data":{ExamPlan}}
     *
     */

    //==================================================================================================================
    // 修改
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：新增
     * 使用者：教师
     *
     * URL：examPlan!edit.action
     *
     * 参数
     * autoId  必需   考试计划Id
     * termId  可选   学期Id
     * name    可选   计划名称
     * remark  可选   备注
     * state   可选   状态  2正常(默认)、3关闭、4历史
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
    // 删除
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：删除
     * 使用者：高级用户
     *
     * URL：examPlan!del.action
     *
     * 参数
     * autoId  必需   考试计划Id
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
