/** 考试安排 -- 自动 */

    /** 考试批次Id */ private Integer batId    ;
    /** 考试任务Id */ private String  taskIds  ; //多个用“,”隔开
    /** 考试课程Id */ private String  couIds   ; //多个用“,”隔开
    /** 班级Id     */ private String  claIds   ; //多个用“,”隔开
    /** 考卷Id     */ private String  paperIds ; //多个用“,”隔开
    /** 考试班Id   */ private String  exmClaIds; //多个用“,”隔开

    //==================================================================================================================
    // 自动排考
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：自动排考
     * 使用者：高级用户
     *
     * URL：autoArr.action
     *
     * 参数
     * batId      必需   考试批次Id
     * taskIds    可选   考试任务Id  多个用“,”隔开
     * couIds     可选   考试课程Id  多个用“,”隔开
     * claIds     可选   班级Id      多个用“,”隔开
     * paperIds   可选   考卷Id      多个用“,”隔开
     * exmClaIds  可选   考试班Id    多个用“,”隔开
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":成功信息}
     * 
     * 注意：没有指定考卷的考试班，不参加自动排考
     *
     */
    
    //==================================================================================================================
