/** 场地计划 */

	/** 排课计划Id */ private Integer scpId   ;
	/** 场地Id     */ private Integer romId   ;
	/** 初始课表   */ private Long    iniSched;
	/** 并班系数   */ private Byte    merge   ;
	/** 人数上限   */ private Short   manMax  ;
	/** 排课学期Id */ private Integer termId  ;
	/** 场地编号   */ private String  romNO   ;
	/** 场地名称   */ private String  romName ;
	/** 教室类型   */ private Integer romType ;

	/** 排序字段   */ private String[] orderFd    ; //排序字段的名称，倒序前面加“@”，可以多个
	/** 场地Id(组) */ private String   romIds     ; //多个用“,”隔开
    /** 位化课表   */ private String   bitStrSched;
    /** 返回周课表 */ private Byte     rtnCurSched;

	//==================================================================================================================
	// 查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：查询
	 * 使用者：+ 部门负责人(自己负责的部门)
	 *
	 * URL：schRomPlan!query.action
	 *
	 * 参数
	 * start        可选   记录开始位置
	 * limit        可选   获取记录数量
	 * scpId        必需   排课计划Id
	 * romId        可选   场地Id
	 * iniSched     可选   初始课表
	 * merge        可选   并班系数
	 * manMax       可选   人数上限
	 * termId       可选   排课学期Id
	 * romNO        可选   场地编号
	 * romName      可选   场地名称
	 * romType      可选   教室类型
	 * orderFd      可选   排序字段的字段名称，倒序前面加“@”
	 * rtnCurSched  可选   1=返回当前课表（还必需指定scpId参数），默认不返回
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"total":"总记录数","dataList":[V_SchRomPlan]}
	 *
	 */

	//==================================================================================================================
	// 新增
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：新增
	 * 使用者：+ 部门负责人
	 *
	 * URL：schRomPlan!newRec.action
	 *
	 * 参数
	 * scpId        必需   排课计划Id
	 * romId        必需   场地Id
	 * bitStrSched  必需   初始课表
	 * merge        可选   并班系数  默认取场地设置
	 * manMax       可选   人数上限  默认取场地的座位数量
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功能信息","data":{V_SchRomPlan}}
	 *
	 */

	//==================================================================================================================
	// 修改
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：修改
	 * 使用者：+ 部门负责人
	 *
	 * URL：schRomPlan!edit.action
	 *
	 * 参数
	 * scpId        必需   排课计划Id
	 * romId        必需   场地Id
	 * bitStrSched  可选   初始课表
	 * merge        可选   并班系数
	 * manMax       可选   人数上限
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 删除
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：删除
	 * 使用者：
	 *
	 * URL：schRomPlan!del.action
	 *
	 * 参数
	 * scpId    必需   排课计划Id
	 * romIds   必需   场地Id 多个用“,”隔开
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

	//==================================================================================================================
