/** 排课管理 */


    /** 教学计划Id(组) */ private String tepIds; //多个用“,”隔开
	/** 开课计划Id(组) */ private String tcoIds; //多个用“,”隔开

    /** 排课主计划Id     */ private Integer scpId  ;
	/** 排课细计划Id(组) */ private String  scpDIds; //多个用“,”隔开
    /** 处理类型         */ private Byte    type   ;

    /** 初始教学班   */ private Byte iniTcc  ;
    /** 初始课表成员 */ private Byte iniSch  ;
    /** 初始排课方案 */ private Byte iniScm  ;
    /** 覆盖课表设置 */ private Byte reIniSch;

    /** 清除排课结果：计划内的排课 */ private Byte clearSched1;
    /** 清除排课结果：源自自任课表 */ private Byte clearSched2;
    /** 清除排课结果：其它临时排课 */ private Byte clearSched3;

    //==================================================================================================================
    // 开课计划 --生成--> 排课细计划
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：开课计划 --生成--> 排课细计划
     * 使用者：
     *
     * URL：schedMng!tco2scpd.action
     *
     * 参数：
     * scpId    必需   排课主计划Id
     * tepIds   2选1   教学计划Id 多个用“,”隔开 -- 如果存在tcoIds，则忽略该条件
     * tcoIds   2选1   开课计划Id 多个用“,”隔开
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     * 注：如果相应的“开课计划”没有包含排课学期，则不会生成相应的排课细计划
     * 注：如果以“教学计划Id(tepIds)”为条件，则只取其中状态正常(state=2)的开课计划
     * 注：如果相应的“行政班+课程”已经存在，则不再重复生成
     *
     */

    //==================================================================================================================
    // 初始排课计划
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：初始排课计划：创建教学班 + 为相关教师、行政班、教学班、场地，创建初始课表记录
     * 使用者： + 部门负责人(自己负责的部门)
     *
     * URL：schedMng!iniSchedule.action
     *
     * 参数：
     * scpId      必需   排课主计划Id
     * scpDIds    可选   排课细计划Id，多个用“,”隔开
     * iniTcc     可选   1=初始化教学班 -- 根据行政班设置，自动创建教学班，已经存在教学班的，则保持原有数据
     * iniSch     可选   1=初始课表成员 -- 为相关成员(教师、班级、场地)创建初始课表，已经存在的保持原有数据
     * iniScm     可选   1=初始排课方案 -- 如果你已调整好排课方案，该操作可能会生成一些你不需要的排课方案，需要你去重新调整
     * reIniSch   可选   1=覆盖课表成员 -- 是对“初始课表成员”的补允，在初始课表成员时，将覆盖原有数据
     * type       可选   初始排课方案时：1=引用第1个场地信息(默认)、2=不引用场地，即场地以后再决定
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     * 说明：原先已有教学班，或已有初始课表记录，则不会再创建，保留原先的数据
     *
     */

    //==================================================================================================================
    // 初始排课方案 -- 作废保留，已归并到上面
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：初始排课方案：组合“教师课程 + 班级”
     * 使用者： + 部门负责人(自己负责的部门)
     *
     * URL：schedMng!iniScheme.action
     *
     * 参数：
     * scpId    必需   排课主计划Id
     * scpDIds  可选   排课细计划Id，多个用“,”隔开
     * type     可选   初始排课方案时：1=引用第1个场地信息(默认)、2=不引用场地，即场地以后再决定
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
    // 清除排课结果
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：清除排课结果
     * 使用者： + 部门负责人(归属自己部门的记录)
     *
     * URL：schedMng!clearSched.action
     *
     * 参数：
     * scpId        必需   排课主计划Id
     * clearSched1  可选   1=清除排课结果：计划内的排课
     * clearSched2  可选   1=清除排课结果：源自自任课表
     * clearSched3  可选   1=清除排课结果：其它临时排课
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
    // 备份排课信息
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：备份排课信息
     * 使用者：
     *
     * URL：schedMng!backup.action
     *
     * 参数：
     * scpId   必需   排课计划Id
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     *
     */

    //==================================================================================================================
    // 恢复排课信息
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：恢复排课信息
     * 使用者：
     *
     * URL：schedMng!restore.action
     *
     * 参数：
     * scpId   必需   排课计划Id(用于匹配)
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
    // 导入任课信息
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：导入任课信息
     * 使用者：
     *
     * URL：schedMng!importThrCou.action
     *
     * 参数：
     * scpId    必需   教学计划Id
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
    // 生成教师任课信息
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：生成教师任课信息
     * 使用者：
     *
     * URL：schedMng!buildThrCou.action
     *
     * 参数：
     * scpId    必需   排课计划Id
     * type     可选   0(默认)=不包含“来自任课表”的排课数据、1=所有排课数据
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

	//==================================================================================================================
