/** 排课 */

	/** 排课计划Id */ private Integer scpId;
    /** 教师Id     */ private Integer thrId;
    /** 课程Id     */ private Integer couId;
    /** 行政班Id   */ private Integer claId;
    /** 教学班Id   */ private Integer tccId;
    /** 场所Id     */ private Integer romId;
    /** 场所Id(组) */ private String romIds;

    /** 排课方案Id  */ private Integer scpSId ;
    /** 排课结果Id  */ private Integer schedId;
    /** 开课类型    */ private Integer couType;
    /** 学分        */ private Double  credit ;
    /** 视角        */ private Byte    angle  ; //1=教师、2=行政班、3=教学班、4=场地
    /** 视角Id      */ private Integer angleId;
    /** 周几(1-7)   */ private Byte    ofWeek ;
    /** 第几节(1-8) */ private Byte    section;

    /** 排课结果Id1            */ private Integer schedId1;
    /** 排课结果Id2            */ private Integer schedId2;
    /** 课表位置1：周几(1-7)   */ private Byte    ofWeek1 ;
    /** 课表位置1：第几节(1-8) */ private Byte    section1;
    /** 课表位置2：周几(1-7)   */ private Byte    ofWeek2 ;
    /** 课表位置2：第几节(1-8) */ private Byte    section2;

    /** 处理类型         */ private Byte    doType     ;
	/** 排课细计划Id(组) */ private String  scpDIds    ; //多个用“,”隔开
	/** 开课周           */ private Integer weekHave   ;
	/** 周课表           */ private Long    weekSched  ;
    /** 位化课表         */ private String  bitStrSched;
    /** 位化开课周       */ private String  bitStrWeekH;
    /** 临时计划课时     */ private Byte    bufLesNum  ;
	/** 课表缓冲Id       */ private Integer schBufId   ;

    //==================================================================================================================
    // 查询：未排课程
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询未排课程；与 schScheme!query2 区别是这个包含缓冲课表
     * 使用者：+ 部门负责人
     *
     * URL：schedMake!unFinishScm.action
     *
     * 参数：
     * scpId    必需   排课计划Id
     * claId    可选   行政班Id
     * tccId    可选   教学班Id
     * thrId    可选   教师Id
     * romId    可选   场地Id
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,dataList":[V_SchedScheme]}
     *
     * 注：如果来自缓冲课表(不是标准的排课方案)，则：scpSId = 缓冲课表Id、scpDId = -1
     *
     */

    //==================================================================================================================
    // 查询可用的排课位置 -- 计划方案
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询可用的排课位置 -- 计划方案
     * 使用者：+ 部门负责人
     *
     * URL：schedMake!enableSch.action
     *
     * 参数：
     * scpSId    必需   排课方案Id
     * romIds    可选   变更场地Id(组) 多个用“,”隔开，数量上必需与排课方案所在的方案组一致，组内取值0代表不变更
     * angle     可选   视角：1=教师、2=行政班级、3=教学班、4=场地
     * angleId   可选   视角Id（对应：教师Id、行政班Id、教学班Id、场地Id）
     * ofWeek    可选   当前课表位置：周几(1-7)
     * section   可选   当前课表位置：第几节(1-8)
     *
     * 注1：angle 与 angleId 配对，必需一起指定； 用于：单视角界面，新课表排入
     * 注2：ofWeek 与 section 配对，必需一起指定；用于：单视角界面，更换原课表位置
     * 注3：如果 angle 没有指定，ofWeek 与 section 也无效
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"sched":"按位字符串化的课表"}
     *
     */

    //==================================================================================================================
    // 查询可用的排课位置2 -- 非计划方案
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询可用的排课位置2 -- 非计划方案
     * 使用者：+ 部门负责人
     *
     * URL：schedMake!enableSch2.action
     *
     * 参数：
     * scpId        必需   排课计划Id
     * thrId        可选   教师Id
     * couId        可选   课程Id
     * claId        可选   行政班Id
     * tccId        可选   教学班Id
     * romId        可选   场所Id
     * angle        可选   视角：1=教师、2=行政班级、3=教学班、4=场地
     * angleId      可选   视角Id（对应：教师Id、行政班Id、教学班Id、场地Id）
     * ofWeek       可选   当前课表位置：周几(1-7)
     * section      可选   当前课表位置：第几节(1-8)
     * bitStrWeekH  可选   位化开课周 -- 默认获取计划设置
     *
     * 注：参考上面的enableSch接口
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"sched":"按位字符串化的课表"}
     *
     */

    //==================================================================================================================
    // 查询可用的排课位置3 -- 排课结果
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询可用的排课位置3 -- 排课结果
     * 使用者：+ 部门负责人
     *
     * URL：schedMake!enableSch3.action
     *
     * 参数：
     * schedId   必需   排课结果Id
     * angle     可选   视角：1=教师、2=行政班级、3=教学班、4=场地
     * angleId   可选   视角Id（对应：教师Id、行政班Id、教学班Id、场地Id）
     * ofWeek    可选   当前课表位置：周几(1-7)
     * section   可选   当前课表位置：第几节(1-8)
     *
     * 注1：angle 与 angleId 配对，必需一起指定； 用于：单视角界面，新课表排入
     * 注2：ofWeek 与 section 配对，必需一起指定；用于：单视角界面，更换原课表位置
     * 注3：如果 angle 没有指定，ofWeek 与 section 也无效
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"sched":"按位字符串化的课表"}
     *
     */

	//==================================================================================================================
	// 查询相关课表 -- 用于冲突判断
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：查询相关课表 -- 用于冲突判断
	 * 使用者：
	 *
	 * URL：schedMake!relSched.action
	 *
	 * 参数
	 * schedId   必需   排课结果Id
     * ofWeek    必需   周几(1-7)
     * section   必需   第几节(1-8)
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"total":"总记录数","dataList":[Schedule]}
	 *
	 * 返回：与指定排课结果的成员(教师、班级、场地)相关的所有排课结果，包括自身
	 *
	 */

    //==================================================================================================================
    // 新增排课结果 -- 计划方案
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：新增排课结果 -- 计划方案
     * 使用者：+ 部门负责人
     *
     * URL：schedMake!putSched.action
     *
     * 参数：
     * scpSId    必需   排课方案Id  [注：如果该值为负数，则自动切换成 putSchedBuf 接口]
     * ofWeek    必需   周几(1-7)
     * section   必需   第几节(1-8)
     * romIds    可选   变更场地Id(组) 多个用“,”隔开，数量上必需与排课方案所在的方案组一致，组内取值0代表不变更
     * angle     可选   视角：1=教师、2=行政班级、3=教学班、4=场地
     * angleId   可选   视角Id（对应：教师Id、行政班Id、教学班Id、场地Id）
     *
     * 注1：angle 与 angleId 配对，必需一起指定； 用于：单视角界面，删除原先在该位置的排课信息
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功能信息","data":{Schedule}}
     *
     */

    //==================================================================================================================
    // 新增排课结果 -- 来自课表缓冲
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：新增排课结果 -- 来自课表缓冲
     * 使用者：+ 部门负责人
     *
     * URL：schedMake!putSchedBuf.action
     *
     * 参数：
     * schBufId   必需   课表缓冲Id
     * ofWeek     必需   周几(1-7)
     * section    必需   第几节(1-8)
     * angle      可选   视角：1=教师、2=行政班级、3=教学班、4=场地
     * angleId    可选   视角Id（对应：教师Id、行政班Id、教学班Id、场地Id）
     *
     * 注1：angle 与 angleId 配对，必需一起指定； 用于：单视角界面，删除原先在该位置的排课信息
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功能信息","data":{Schedule}}
     *
     */

    //==================================================================================================================
    // 新增排课结果 -- 即时排课
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：新增排课结果 -- 即时排课
     * 使用者：+ 部门负责人
     *
     * URL：schedMake!putSchedNoPlan.action
     *
     * 参数：
     * scpId        必需   排课计划Id
     * couType      必需   开课类型
     * thrId        必需   教师Id
     * couId        必需   课程Id
     * claId        2选1   行政班Id
     * tccId        2选1   教学班Id -- 指定了claId，将忽略该项
     * romId        可选   场地Id
     * ofWeek       可选   周几(1-7)
     * section      可选   第几节(1-8)
     * bitStrWeekH  可选   位化开课周 -- 默认获取计划设置
     * bitStrSched  可选   位化课表   -- 指定(ofWeek/section)后，忽略该项
     * bufLesNum    可选   计划要排几个课时 -- 如果指定，不能少于实际排入课时
     *
     * 注1：ofWeek 与 section 要配对，必需一起指定
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功能信息","data":{Schedule}}
     *
     */

    //==================================================================================================================
    // 移动/交换 -- 排课结果
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：移动/交换 -- 排课结果
     * 使用者：+ 部门负责人
     *
     * URL：schedMake!moveSched.action
     *
     * 参数：
     * schedId   必需   排课结果Id -- 将从 位置1 移到 位置2
     * ofWeek1   必需   课表原位置1：周几(1-7)
     * section1  必需   课表原位置1：第几节(1-8)
     * ofWeek2   必需   课表新位置2：周几(1-7)
     * section2  必需   课表新位置2：第几节(1-8)
     * angle     可选   视角：1=教师、2=行政班级、3=教学班、4=场地
     * angleId   可选   视角Id（对应：教师Id、行政班Id、教学班Id、场地Id）
     * doType    可选   原位置的课表处理：1保留(默认)、2移除、3交换
     *
     * 注1：angle 与 angleId 配对，必需一起指定； 用于：单视角界面，处理课表位置原先的排课信息
     * 注2：如果没指定 angle 与 angleId；移除 与 交换 将涉及所有成员
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功能信息"}
	 *
	 * 注意：因为允许冲突，目标位置可能有大量课表存在，如果选择“移除、交换”，都会被处理
     *
     */

    //==================================================================================================================
    // 交换排课结果
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：交换排课结果
     * 使用者：+ 部门负责人
     *
     * URL：schedMake!swapSched.action
     *
     * 参数：
     * schedId1   必需   排课结果Id -- 将从 位置1 移到 位置2
     * schedId2   必需   排课结果Id -- 将从 位置2 移到 位置1
     * ofWeek1    必需   课表原位置1：周几(1-7)
     * section1   必需   课表原位置1：第几节(1-8)
     * ofWeek2    必需   课表新位置2：周几(1-7)
     * section2   必需   课表新位置2：第几节(1-8)
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功能信息"}
     *
     */

    //==================================================================================================================
    // 移除(删除) -- 排课结果
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：移除(删除) -- 排课结果
     * 使用者：+ 部门负责人
     *
     * URL：schedMake!delSched.action
     *
     * 参数：
     * schedId   必需   排课结果Id
     * ofWeek    必需   课表位置：周几(1-7)
     * section   必需   课表位置：第几节(1-8)
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功能信息"}
     *
     */

    //==================================================================================================================
    // 自动排课
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：自动排课
     * 使用者： + 部门负责人(自己负责的部门)
     *
     * URL：schedMake!auto.action
     *
     * 参数：
     * scpId    必需   排课主计划Id
     * scpDIds  可选   排课细计划Id，多个用“,”隔开
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
