/** 排课主计划 */

	/** 排课计划Id   */ private Integer scpId        ;
	/** 排课学期Id   */ private Integer termId       ;
	/** 排课计划名称 */ private String  scpName      ;
	/** 标准周课时   */ private Short   staWeekLesNum;
	/** 课表模板     */ private Long    weekSchedule ;
	/** 开课周       */ private Integer weekHave     ;
	/** 开放查询     */ private Byte    openQuery    ; //1=不可查询(默认)、2=开放查询
	/** 计划录入     */ private Byte    openPlanInput; //1=不可录入(默认)、2=开放录入
	/** 开放排课     */ private Byte    openPlanCou  ; //1=不可排课(默认)、2=开放排课
	/** 备注         */ private String  remark       ;
	/** 排课计划状态 */ private Byte    scpState     ; //2正常(默认) 3关闭 4完成
	/** 学期编号     */ private String  termNO       ;
	/** 学期名称     */ private String  termName     ;

	/** 排序字段       */ private String[] orderFd    ; //排序字段的名称，倒序前面加“@”，可以多个
	/** 排课计划Id(组) */ private String   scpIds     ; //多个用“,”隔开
    /** 位化课表       */ private String   bitStrSched;
    /** 位化开课周     */ private String   bitStrWeekH;

	//==================================================================================================================
	// 查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：查询
	 * 使用者：
	 *
	 * URL：schedPlan!query.action
	 *
	 * 参数
	 * start          可选   记录开始位置
	 * limit          可选   获取记录数量
	 * scpId          可选   排课计划Id
	 * termId         可选   排课学期Id
	 * scpName        可选   排课计划名称
	 * staWeekLesNum  可选   标准周课时
	 * weekSchedule   可选   课表模板
	 * weekHave       可选   开课周
	 * openQuery      可选   开放查询 1=不可查询(默认)、2=开放查询
	 * openPlanInput  可选   计划录入 1=不可录入(默认)、2=开放录入
	 * openPlanCou    可选   开放排课 1=不可排课(默认)、2=开放排课
	 * remark         可选   备注
	 * scpState       可选   排课计划状态 2正常(默认) 3关闭 4完成
	 * orderFd        可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"total":"总记录数","dataList":[SchedPlan]}
	 *
	 */

	//==================================================================================================================
	// 查询2 -- 引入：学期名称
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：查询2 -- 引入：学期名称
	 * 使用者：
	 *
	 * URL：schedPlan!query.action
	 *
	 * 参数
	 * start          可选   记录开始位置
	 * limit          可选   获取记录数量
	 * scpId          可选   排课计划Id
	 * termId         可选   排课学期Id
	 * scpName        可选   排课计划名称
	 * staWeekLesNum  可选   标准周课时
	 * weekSchedule   可选   课表模板
	 * weekHave       可选   开课周
	 * openQuery      可选   开放查询 1=不可查询(默认)、2=开放查询
	 * openPlanInput  可选   计划录入 1=不可录入(默认)、2=开放录入
	 * openPlanCou    可选   开放排课 1=不可排课(默认)、2=开放排课
	 * remark         可选   备注
	 * scpState       可选   排课计划状态 2正常(默认) 3关闭 4完成
	 * termNO         可选   学期编号
	 * termName       可选   学期名称
	 * orderFd        可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"total":"总记录数","dataList":[V_SchedPlan]}
	 *
	 */

	//==================================================================================================================
	// 新增
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：新增
	 * 使用者：
	 *
	 * URL：schedPlan!newRec.action
	 *
	 * 参数
	 * termId         必需   排课学期Id
	 * scpName        必需   排课计划名称
	 * staWeekLesNum  可选   标准周课时
	 * openQuery      可选   开放查询 1=不可查询(默认)、2=开放查询
	 * openPlanInput  可选   计划录入 1=不可录入(默认)、2=开放录入
	 * openPlanCou    可选   开放排课 1=不可排课(默认)、2=开放排课
	 * remark         可选   备注
     * bitStrSched    可选   位化课表
     * bitStrWeekH    可选   位化开课周
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功能信息","data":{SchedPlan}}
	 *
	 */

	//==================================================================================================================
	// 修改
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：修改
	 * 使用者：
	 *
	 * URL：schedPlan!edit.action
	 *
	 * 参数
	 * scpId          必需   排课计划Id
	 * termId         可选   排课学期Id
	 * scpName        可选   排课计划名称
	 * staWeekLesNum  可选   标准周课时
	 * openQuery      可选   开放查询 1=不可查询(默认)、2=开放查询
	 * openPlanInput  可选   计划录入 1=不可录入(默认)、2=开放录入
	 * openPlanCou    可选   开放排课 1=不可排课(默认)、2=开放排课
	 * remark         可选   备注
     * bitStrSched    可选   位化课表
     * bitStrWeekH    可选   位化开课周
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 修改记录状态
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：修改记录状态
	 * 使用者：
	 *
	 * URL：schedPlan!chState.action
	 *
	 * 参数
	 * scpIds     必需   排课计划Id 多个用“,”隔开
	 * scpState   必需   状态值
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 删除
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：删除
	 * 使用者：
	 *
	 * URL：schedPlan!del.action
	 *
	 * 参数
	 * scpIds   必需   排课计划Id 多个用“,”隔开
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

	//==================================================================================================================
