/** 计划教学班 */

	/** 明细计划Id     */ private Integer scpDId   ;
	/** 教学班Id       */ private Integer tccId    ;
	/** 教学班已排课时 */ private Byte    tccLesNum;
	/** 教学班类型     */ private Byte    tccType  ; //代码类型52 2教学班(默认)、8选课班、9任课班
	/** 教学班编号     */ private String  tccNO    ;
	/** 教学班名称     */ private String  tccName  ;
	/** 教学班年级     */ private Integer tccGrade ; //系统代码35
	/** 教学班专业     */ private Integer tccMajor ; //系统代码3
	/** 教学班校区Id   */ private Integer tccCamId ;
	/** 教学班学部Id   */ private Integer tccDepId ;
	/** 教学班教室Id   */ private Integer tccRomId ;

	/** 排序字段       */ private String[] orderFd; //排序字段的名称，倒序前面加“@”，可以多个
	/** 明细计划Id(组) */ private String   scpDIds; //多个用“,”隔开
	/** 教学班Id(组)   */ private String   tccIds ; //多个用“,”隔开

	//==================================================================================================================
	// 查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：查询
	 * 使用者：
	 *
	 * URL：scpTcc!query.action
	 *
	 * 参数
	 * start        可选   记录开始位置
	 * limit        可选   获取记录数量
	 * scpDId       可选   明细计划Id
	 * tccId        可选   教学班Id
	 * tccLesNum    可选   教学班已排课时
	 * tccType      可选   教学班类型 代码类型52 2教学班(默认)、8选课班、9任课班
	 * tccNO        可选   教学班编号
	 * tccName      可选   教学班名称
	 * tccGrade     可选   教学班年级 系统代码35
	 * tccMajor     可选   教学班专业 系统代码3
	 * tccCamId     可选   教学班校区Id
	 * tccDepId     可选   教学班学部Id
	 * tccRomId     可选   教学班教室Id
	 * orderFd      可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"total":"总记录数","dataList":[V_ScpTcc]}
	 *
	 */

	//==================================================================================================================
	// 新增
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：新增
	 * 使用者：
	 *
	 * URL：scpTcc!newRec.action
	 *
	 * 参数
	 * scpDId    必需   明细计划Id
	 * tccId     必需   教学班Id
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功能信息","data":{V_ScpTcc}}
	 *
	 */

	//==================================================================================================================
	// 删除
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：删除
	 * 使用者：
	 *
	 * URL：scpTcc!del.action
	 *
	 * 参数
	 * scpDIds   必需   明细计划Id 多个用“,”隔开
	 * tccIds    必需   教学班Id 多个用“,”隔开
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

	//==================================================================================================================
