/** 计划场地 */

	/** 明细计划Id   */ private Integer scpDId   ;
	/** 场地Id       */ private Integer romId    ;
	/** 场地已排课时 */ private Byte    romLesNum;
	/** 场地名称     */ private String  name     ;
	/** 教室类型     */ private Integer type     ;
	/** 教学楼       */ private Integer buiId    ;
	/** 所属部门     */ private Integer depId    ;
	/** 座位数量     */ private Short   seatNum  ;

	/** 排序字段       */ private String[] orderFd; //排序字段的名称，倒序前面加“@”，可以多个
	/** 明细计划Id(组) */ private String   scpDIds; //多个用“,”隔开
	/** 场地Id(组)     */ private String   romIds ; //多个用“,”隔开
	/** 自动初始       */ private Byte     autoIni;

	//==================================================================================================================
	// 查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：查询
	 * 使用者：
	 *
	 * URL：scpRom!query.action
	 *
	 * 参数
	 * start        可选   记录开始位置
	 * limit        可选   获取记录数量
	 * scpDId       可选   明细计划Id
	 * romId        可选   场地Id
	 * romLesNum    可选   场地已排课时
	 * name         可选   场地名称
	 * type         可选   教室类型
	 * buiId        可选   教学楼
	 * depId        可选   所属部门
	 * seatNum      可选   座位数量
	 * orderFd      可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"total":"总记录数","dataList":[V_ScpRom]}
	 *
	 */

	//==================================================================================================================
	// 新增
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：新增
	 * 使用者：
	 *
	 * URL：scpRom!newRec.action
	 *
	 * 参数
	 * scpDId    必需   明细计划Id
	 * romId     必需   场地Id
	 * autoIni   可选   1=自动创建场地计划(如果还未创建)，默认不创建
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功能信息","data":{V_ScpRom}}
	 *
	 */

	//==================================================================================================================
	// 删除
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：删除
	 * 使用者：
	 *
	 * URL：scpRom!del.action
	 *
	 * 参数
	 * scpDIds   必需   明细计划Id 多个用“,”隔开
	 * romIds    必需   场地Id 多个用“,”隔开
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

	//==================================================================================================================
