/** 计划教师 */

	/** 明细计划Id   */ private Integer scpDId   ;
	/** 教师Id       */ private Integer thrId    ;
	/** 课程Id       */ private Integer couId    ;
	/** 教师已排课时 */ private Byte    thrLesNum;
	/** 教师姓名     */ private String  thrName  ;
	/** 教师性别     */ private String  thrSex   ;
	/** 课程名称     */ private String  couName  ;

	/** 排序字段       */ private String[] orderFd; //排序字段的名称，倒序前面加“@”，可以多个
	/** 明细计划Id(组) */ private String   scpDIds; //多个用“,”隔开
	/** 教师Id(组)     */ private String   thrIds ; //多个用“,”隔开
	/** 课程Id(组)     */ private String   couIds ; //多个用“,”隔开

	//==================================================================================================================
	// 查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：查询
	 * 使用者：
	 *
	 * URL：scpThr!query.action
	 *
	 * 参数
	 * start        可选   记录开始位置
	 * limit        可选   获取记录数量
	 * scpDId       可选   明细计划Id
	 * thrId        可选   教师Id
	 * couId        可选   课程Id
	 * thrLesNum    可选   已排课时
	 * thrName      可选   教师姓名
	 * thrSex       可选   教师性别
	 * couName      可选   课程名称
	 * orderFd      可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"total":"总记录数","dataList":[V_ScpThrCou]}
	 *
	 */

	//==================================================================================================================
	// 新增
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：新增
	 * 使用者：
	 *
	 * URL：scpThr!newRec.action
	 *
	 * 参数
	 * scpDId   必需   明细计划Id
	 * thrId    必需   教师Id
	 * couId    必需   课程Id
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功能信息","data":{V_ScpThrCou}}
	 *
	 */

	//==================================================================================================================
	// 删除
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：删除
	 * 使用者：
	 *
	 * URL：scpThr!del.action
	 *
	 * 参数
	 * scpDIds   必需   明细计划Id 多个用“,”隔开
	 * thrIds    必需   教师Id 多个用“,”隔开
	 * couIds    必需   课程Id 多个用“,”隔开
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

	//==================================================================================================================
