/** 课程计划 */

	/** 排课计划Id */ private Integer scpId      ;
	/** 课程Id     */ private Integer couId      ;
	/** 初始课表   */ private Long    iniSched   ;
	/** 排课学期Id */ private Integer termId     ;
	/** 课程编号   */ private String  couNO      ;
	/** 课程名称   */ private String  couName    ;
	/** 课时权重   */ private Double  couLesPower;

	/** 排序字段       */ private String[] orderFd    ; //排序字段的名称，倒序前面加“@”，可以多个
	/** 课程Id(组)     */ private String   couIds     ; //多个用“,”隔开
    /** 位化课表       */ private String   bitStrSched;

	//==================================================================================================================
	// 查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：查询
	 * 使用者：
	 *
	 * URL：schCouPlan!query.action
	 *
	 * 参数
	 * start        可选   记录开始位置
	 * limit        可选   获取记录数量
	 * scpId        可选   排课计划Id
	 * couId        可选   课程Id
	 * iniSched     可选   初始课表
	 * termId       可选   排课学期Id
	 * couNO        可选   课程编号
	 * couName      可选   课程名称
	 * couLesPower  可选   课时权重
	 * orderFd      可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"total":"总记录数","dataList":[V_SchCouPlan]}
	 *
	 */

	//==================================================================================================================
	// 保存
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：保存
	 * 使用者：+ 部门负责人
	 *
	 * URL：schCouPlan!saveRec.action
	 *
	 * 参数
	 * scpId        必需   排课计划Id
	 * couId        必需   课程Id
	 * bitStrSched  可选   初始课表
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功能信息","data":{SchCouPlan}}
	 *
	 */

	//==================================================================================================================
	// 删除
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：删除
	 * 使用者：
	 *
	 * URL：schCouPlan!del.action
	 *
	 * 参数
	 * scpId    必需   排课计划Id
	 * couIds   必需   课程Id 多个用“,”隔开
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

	//==================================================================================================================
