/** 学生选课任务 */

    /** 学生Id     */ private Integer   stuId    ;
    /** 选课计划Id */ private Integer   xkpId    ;
    /** 开始时间   */ private Timestamp startTime;
    /** 关闭时间   */ private Timestamp endTime  ;
    /** 完成时间   */ private Timestamp overTime ;
    /** 状态       */ private Byte      state    ;
    /** 计划编号   */ private String    planNO   ;
    /** 计划名称   */ private String    planName ;
    /** 学号       */ private String    stuNO    ;
    /** 学生姓名   */ private String    stuName  ;
    /** 年级段代码 */ private Integer   grade    ;
    /** 学生班级Id */ private Integer   stuClaId ;

    /** 学生Id(多)   */ private String stuIds   ;
    /** 待选课Id(多) */ private int[]  selCouIds;

    //==================================================================================================================
    // 查询
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询学生任务信息
     * 使用者：教师(未限制)、学生只能对自已操作(不显示已完成的任务)
     *
     * URL：stuXkTask!query.action
     *
     * 参数：
     * start     必需   记录开始位置
     * limit     必需   获取记录数量
     * planNO    可选   计划编号(模糊匹配)
     * planName  可选   计划名称(模糊匹配)
     * stuNO     可选   学号    (模糊匹配) [当操作者是学生，该参数无效]
     * stuName   可选   学生姓名(模糊匹配) [当操作者是学生，该参数无效]
     * grade     可选   入学年份(年级段)   [当操作者是学生，该参数无效]
     * stuClaId  可选   学生班级Id         [当操作者是学生，该参数无效]
     *
     * 出错返回：{"success":false,"message":"错误信息"}
     * 正确返回：{"success":true,"total":"总记录数","dataList":[V_StuXkTask]}
     *
     */

    //==================================================================================================================
    // 新增
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：新增学生任务
     * 使用者：教师
     *
     * URL：stuXkTask!newRec.action
     *
     * 参数：
     * planNO     必需   选课计划编号
     * stuIds     2选1   学生Id  多个用“,”隔开
     * stuNO      2选1   学号 -- 如果存在 stuIds，则忽略该参数
     * startTime  可选   开启时间
     * endTime    可选   关闭时间
     *
     * 出错返回：{"success":false,"message":"错误信息"}
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
    //修改
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：修改学生选课
     * 使用者：教师
     *
     * URL：stuXkTask!edit.action
     *
     * 参数：
     * stuId      必需   学生Id
     * xkpId      必需   计划Id
     * startTime  可选   开启时间
     * endTime    可选   关闭时间
     *
     * 出错返回：{"success":false,"message":"错误信息"}
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
    // 删除
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：删除学生任务信息
     * 使用者：教师(未限制)、学生只能对自已操作
     *
     * URL：stuXkTask!del.action
     *
     * 参数：
     * stuId   必需   学生Id -- 学生操作时，该参数无效，只能对自己操作
     * xkpId   必需   计划Id
     *
     * 出错返回：{"success":false,"message":"错误信息"}
     * 正确返回：{"success":true,"message":"删除成功"}
     *
     */

    //==================================================================================================================
    // 批量修改时间
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：批量修改时间
     * 使用者：教师
     *
     * URL：stuXkTask!chTime.action
     *
     * 参数：
     * xkpId      必需   计划Id
     * stuIds     必需   学生Id  多个用“,”隔开
     * startTime  可选   开启时间
     * endTime    可选   关闭时间
     *
     * 出错返回：{"success":false,"message":"错误信息"}
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
    // 修改状态
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：修改状态
     * 使用者：教师
     *
     * URL：stuXkTask!chState.action
     *
     * 参数：
     * xkpId   必需   选课计划Id
     * stuId   必需   学生Id
     * state   必需   新的状态：2开启、3关闭、4完成
     *
     * 出错返回：{"success":false,"message":"错误信息"}
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
    // 完成任务
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：完成任务
     * 使用者：学生专用：只能操作自己，任务必需处于未完成状态，完成时间取当前时间
     *
     * URL：stuXkTask!overTask.action
     *
     * 参数：
     * xkpId    必需   计划Id
     *
     * 出错返回：{"success":false,"message":"错误信息"}
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
