/** 学生选课 */

    /** 学生Id       */ private Integer stuId   ;
    /** 待选课Id     */ private Integer selCouId;
    /** 选课计划Id   */ private Integer xkpId   ;
    /** 课程分组代码 */ private Integer groupCd ;
    /** 课程分组名称 */ private String  groupNm ;
    /** 查询类型     */ private int     type    ;

    /** 待选课程类型 */ private int stuSel;

    //==================================================================================================================
    // 学生 --> 查询可选课程
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：获取可选课程信息
     * 使用者：教师(未限制)、学生只能查自已相关的记录
     *
     * URL：stuSelCou!getCourse.action
     *
     * 参数：
     * xkpId     必需   选课计划Id
     * stuId     必需   学生Id [当操作者是学生，该参数无效]
     * groupCd   可选   课程分组代码
     * groupNm   可选   课程分组名称 始果指定了groupCd，则这个参数无效
     *
     * 出错返回：{"success":false,"message":"错误信息"}
     * 正确返回：{"success":true,"total":"总记录数","dataList":[V_SelCourseExt]}
     *
     * 说明：返回 stuSel ＝ 0可选，1可选(但人数已满)，2不可选(与自己其它课程冲突)，3已选
     *
     */

    //==================================================================================================================
    // 学生 --> 选课
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：学生选课
     * 使用者：教师(未限制)、学生只能对自已操作
     *
     * URL：stuSelCou!select.action
     *
     * 参数：
     * stuId       必需   学生Id [当操作者是学生，该参数无效]
     * selCouId    必需   待选课Id
     *
     * 出错返回：{"success":false,"message":"错误信息"}
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
    // 学生 --- 取消选课 [有任务时间限制]
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：删除(学生版) --- 学生取消选课 [有任务时间限制]
     * 使用者：教师、学生(只能操作自己的自已记录)
     *
     * URL：stuSelCou!del.action
     *
     * 参数：
     * stuId       必需   学生Id [当操作者是学生，该参数无效]
     * selCouId    必需   待选课Id
     *
     * 出错返回：{"success":false,"message":"错误信息"}
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
