/** 学生选课结果 */

    /** 学生Id       */ private Integer stuId       ;
    /** 待选课Id     */ private Integer selCouId    ;
    /** 状态         */ private Byte    state       ; //1预选 2选中(默认) 3确认
    /** 学生学号     */ private String  stuNO       ;
    /** 学生姓名     */ private String  stuName     ;
    /** 学生性别     */ private String  stuSex      ;
    /** 学生班级Id   */ private Integer stuClaId    ;
    /** 学生年级段   */ private Integer stuGrade    ;
    /** 学生班级名称 */ private String  stuClaNm    ;
    /** 选课计划Id   */ private Integer xkpId       ;
    /** 课程Id       */ private Integer couId       ;
    /** 班级Id       */ private Integer claId       ;
    /** 周课表       */ private Long    weekSchedule;
    /** 任务分组     */ private Integer groupCd     ;
    /** 同组计数     */ private Byte    groupN      ;
    /** 学期Id       */ private Integer termId      ;
    /** 计划编号     */ private String  planNO      ;
    /** 计划名称     */ private String  planName    ;
    /** 学期编号     */ private String  termNO      ;
    /** 学期名称     */ private String  termName    ;
    /** 课程编号     */ private String  couNO       ;
    /** 课程名称     */ private String  couName     ;
    /** 班级类型     */ private Byte    claType     ;
    /** 班级编号     */ private String  claNO       ;
    /** 班级名称     */ private String  claName     ;
    /** 班级年级     */ private Integer claGrade    ;

    /** 计划Id(多个)   */ private int[]    xkpIds   ;
    /** 计划编号(多个) */ private String[] planNOs  ;
    /** 学生Ids(多个)  */ private int[]    stuIds   ;
    /** 待选课Id(多个) */ private int[]    selCouIds;
    /** 查询类型       */ private int      type     ;

    //==================================================================================================================
    // 查询
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询学生已选的课程信息
     * 使用者：教师(未限制)
     *
     * URL：stuCou!query.action
     *
     * 参数：
     * start     可选   记录开始位置
     * limit     可选   获取记录数量
     * stuId     可选   学生Id
     * selCouId  可选   待选课Id
     * stuNO     可选   学生学号(模糊匹配)
     * stuName   可选   学生姓名(模糊匹配)
     * stuClaId  可选   学生班级Id
     * stuGrade  可选   学生年级段
     * stuClaNm  可选   学生班级名称(模糊匹配)
     * xkpId     可选   选课计划Id
     * couId     可选   课程Id
     * claId     可选   班级Id
     * groupCd   可选   选课分组
     * termId    可选   学期Id
     * planNO    可选   计划编号
     * planName  可选   计划名称(模糊匹配)
     * termNO    可选   学期编号(模糊匹配)
     * termName  可选   学期名称(模糊匹配)
     * couNO     可选   课程编号(模糊匹配)
     * couName   可选   课程名称(模糊匹配)
     * claType   可选   班级类型           -- 被选的班级
     * claNO     可选   班级编号(模糊匹配) -- 被选的班级
     * claName   可选   班级名称(模糊匹配) -- 被选的班级
     * claGrade  可选   班级年级           -- 被选的班级
     * state     可选   状态  1预选 2选中(默认) 3确认
     *
     * 出错返回：{"success":false,"message":"错误信息"}
     * 正确返回：{"success":true,"total":"总记录数","dataList":[V_StuCourse]}
     *
     */

    //==================================================================================================================
    // 查询2
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询学生已选的课程信息
     * 使用者：教师(未限制)、学生只能查自已相关的记录
     *
     * URL：stuCou!query2.action
     *
     * 参数：
     * start       可选   记录开始位置
     * limit       可选   获取记录数量
     * xkpIds      可选   选课计划Id(可以多个)
     * planNOs     可选   选课计划编号(可以多个)
     * stuIds      可选   学生Id(可多个)
     * selCouIds   可选   待选课Id(可多个)
     *
     * 出错返回：{"success":false,"message":"错误信息"}
     * 正确返回：{"success":true,"total":"总记录数","dataList":[V_StuCourse]}
     *
     */

    //==================================================================================================================
    // 待选课程 --> 学生列表
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：待选课程 --> 学生列表
     * 使用者：教师
     *
     * URL：stuCou!getSelCouStu.action
     *
     * 参数：
     * start      可选   记录开始位置
     * limit      可选   获取记录数量
     * selCouId   必需   待选课Id -- 当type为0时，该参数可以不提供
     * stuGrade   可选   学生年级
     * stuClaId   可选   学生班级
     * stuNO      可选   学生学号(模糊匹配)
     * stuName    可选   学生姓名(模糊匹配)
     * type       可选   0 = 所有学生(默认) ---- 所有状态为2的学生
     *                   1 = 选课计划内的学生 -- 所有获得选课任务的学生
     *                   2 = 可选该课程的学生
     *
     * 出错返回：{"success":false,"message":"错误信息"}
     * 正确返回：{"success":true,"total":"总记录数","dataList":[V_StuBaseInf]}
     *
     * 注：选课时，必需设置好当前学期
     *
     */

    //==================================================================================================================
    // 新增(管理版)
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：新增(管理版)
     * 使用者：高级用户 [注意：无各种限制，人数可超越上限，只要数据存在就成功]
     *
     * URL：stuCou!newRec.action
     *
     * 参数：
     * stuId       必需   学生Id
     * stuNO       必需   学号 如果存在stuId，则忽略该参数
     * selCouId    必需   待选课Id
     *
     * 出错返回：{"success":false,"message":"错误信息"}
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
    // 新增(管理版+学生批量)
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：新增(管理版+学生批量)
     * 使用者：高级用户 [注意：无各种限制，人数可超越上限，只要数据存在就成功]
     *
     * URL：stuCou!newRec2.action
     *
     * 参数：
     * selCouId    必需   待选课Id
     * stuIds      必需   学生Id(多个)
     *
     * 出错返回：{"success":false,"message":"错误信息"}
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
    // 删除(管理版)
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：删除学生选课记录(管理版)
     * 使用者：高级用户
     *   用处：管理端-->选课记录基本管理
     *
     * URL：stuCou!del2.action
     *
     * 参数：
     * stuIds      必需   学生Id(可以多个)
     * selCouIds   必需   待选课Id(可以多个)
     * 注：stuIds与selCouIds，必需配对，数量相同，顺序相同
     *
     * 出错返回：{"success":false,"message":"错误信息"}
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
    // 取消选课 -- 管理选课记录
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：取消选课 -- 管理选课记录
     * 使用者：高级用户
     *   用处：管理端-->按条件删除选课记录
     *     注：相比del2，这里stuIds与selCouIds是进行条件组合，而不是一一配对
     *
     * URL：stuCou!del3.action
     *
     * 参数：
     * stuIds      可选   学生Id(可以多个)   [必需要与xkpId或selCouIds其中一个组合使用]
     * xkpId       可选   选课计划Id         [必需要与stuIds组合使用]
     * selCouIds   可选   待选课Id(可以多个) [如果存在stuIds,xkpId，则忽略这个参数]
     *
     * 出错返回：{"success":false,"message":"错误信息"}
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
    // 修改状态
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：改变待选课程信息状态
     * 使用者：高级用户
     *
     * URL：stuCou!chState.action
     *
     * 参数：
     * stuIds      必需   学生Id(可以多个)
     * selCouIds   必需   待选课Id(可以多个)
     * state       必需   状态(1预选,2选中,3确认)
     *
     * 注：stuIds与selCouIds，必需配对，数量相同，顺序相同
     *
     * 出错返回：{"success":false,"message":"错误信息"}
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
