/** 选课导出 */

    /** 选课计划Id */ private Integer xkpId;
    /** 计划编号   */ private String  planNO;
    /** 课程Id     */ private int     couId;
    /** 学期Id     */ private int     termId;
    /** 教师Id     */ private int     thrId;
    /** 班级Id     */ private int     claId;

    /** 当前人数(最大)               */ private int manNumCurMax;
    /** 当前人数(最小)               */ private int manNumCurMin;
    /** 升学/就业(0所有,1升学,2就业) */ private int upOrWork;
    /** 可选专业编号                 */ private String majorNO;
    /** 选课分组                     */ private int groupCd;
    /** 状态(1草稿,2启用,3关闭)      */ private int state;

    /** 人数状态：0所有，1少于下限，2大于下限，3达到上限  */ private int manNumState;
    /** 课程时段：0所有，1周一，2周二 ... 5周五           */ private int couTime;

    /** 选课计划Id(多个)*/ private int[]    xkpIds;
    /** 计划编号  (多个)*/ private String[] planNOs;
    /** 待选课Id  (多个)*/ private int[]    selCouIds;
    /** 学生Id    (多个)*/ private int[]    stuIds;

    /** 功能版本 */ private int version;

    //==================================================================================================================
    // 导出：待选课信息
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：待选课信息
     * 使用者：高级用户
     *
     * URL：exportXK!outSelCourse.action
     *
     * 参数：
     * start         可选   记录开始位置
     * limit         可选   获取记录数量
     * selCouIds     可选   待选课Id(多) [有了该参数，后面的参数都被忽略]
     * xkpId         可选   选课计划Id
     * planNO        可选   计划编号(模糊匹配)
     * couId         可选   课程Id
     * termId        可选   学期Id
     * thrId         可选   教师Id
     * claId         可选   班级Id
     * manNumCurMax  可选   当前人数小于等于该值
     * manNumCurMin  可选   当前人数大于等于该值
     * upOrWork      可选   升学/就业(0不限制，1所有,2升学,3就业)
     * majorNO       可选   可选专业编号
     * groupCd       可选   选课分组
     * state         可选   状态(1草稿,2启用,3关闭)
     * manNumState   可选   人数状态：0所有，1少于下限，2大于等于下限，3达到上限
     * couTime       可选   课程时段：0所有，1周一，2周二 ... 5周五
     *
     */

    //==================================================================================================================
    // 导出：选择课程的学生 / 学生选择的课程
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：选择课程的学生 / 学生选择的课程
     * 使用者：教师(未限制)、学生只能导出自已相关的记录
     *
     * URL：exportXK!outStuCourset.action
     *
     * 参数：
     * start       可选   记录开始位置
     * limit       可选   获取记录数量
     * xkpIds      可选   选课计划Id  (可多个)
     * planNOs     可选   选课计划编号(可多个)
     * stuIds      可选   学生Id      (可多个) [当操作者是学生，该参数无效]
     * selCouIds   可选   待选课Id    (可多个)
     *
     */

    //==================================================================================================================
    // 导出：课程学生名单
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：课程学生名单
     * 使用者：高级用户
     *
     * URL：exportXK!outCouStuList.action
     *
     * 参数：
     * selCouIds   必需   待选课Id
     * version     可选   功能版本：2 = 2015年09月21日
     *
     */

    //==================================================================================================================
    //导出：待选课信息 + 选择课程的学生
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：待选课信息 + 选择课程的学生
     * 使用者：高级用户
     *
     * URL：exportXK!outSelCouAndStu.action
     *
     * 参数：
     * start         可选   记录开始位置
     * limit         可选   获取记录数量
     * selCouIds     可选   待选课Id(多) [有了该参数，后面的参数都被忽略]
     * xkpId         可选   选课计划Id
     * planNO        可选   计划编号(模糊匹配)
     * couId         可选   课程Id
     * termId        可选   学期Id
     * thrId         可选   教师Id
     * claId         可选   班级Id
     * manNumCurMax  可选   当前人数小于等于该值
     * manNumCurMin  可选   当前人数大于等于该值
     * upOrWork      可选   升学/就业(0不限制，1所有,2升学,3就业)
     * majorNO       可选   可选专业编号
     * groupCd       可选   选课分组
     * state         可选   状态(1草稿,2启用,3关闭)
     * manNumState   可选   人数状态：0所有，1少于下限，2大于等于下限，3达到上限
     * couTime       可选   课程时段：0所有，1周一，2周二 ... 5周五
     *
     */

    //==================================================================================================================
    // 导出：学生选课结果
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：学生选课结果
     * 使用者：高级用户
     *
     * URL：exportXK!outStuSelCouInf.action
     *
     * 参数：
     * xkpId     2选1    选课计划Id
     * planNO    2选1    选课计划编号 如果存在xkpId，则忽略该参
     * claId     可选    班级Id
     * groupCd   可选    选课分组
     * version   可选    功能版本：2 = 2015年09月30日 增加：上课地点、时间、教师信息
     *
     */

    //==================================================================================================================
