/** 选课计划 */

    /** 选课计划Id   */ private Integer   autoId   ;
    /** 学期Id       */ private Integer   termId   ;
    /** 计划编号     */ private String    planNO   ;
    /** 计划名称     */ private String    planName ;
    /** 计划说明     */ private String    planMeno ;
    /** 选课开启时间 */ private Timestamp planStart;
    /** 选课关闭时间 */ private Timestamp planEnd  ;
    /** 选课完成时间 */ private Timestamp planDone ;
    /** 状态         */ private Byte      state    ; //1未开启 2开启(默认) 3关闭 4完成

    /** 按班计划编号排序 */ private Byte      orderO ;
    /** 按学计划名称排序 */ private Byte      orderN ;
    /** 时间             */ private Timestamp time   ;
    /** 排序字段         */ private String[]  orderFd;

    //==================================================================================================================
    // 查询
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询
     * 使用者：教师
     *
     * URL：xkp!query.action
     *
     * 参数：
     * start     可选   记录开始位置
     * limit     可选   获取记录数量
     * autoId    可选   选课计划Id
     * termId    可选   学期Id
     * planNO    可选   计划编号(模糊匹配)
     * planName  可选   计划名称(模糊匹配)
     * state     可选   状态  1未开启 2开启 3关闭 4完成
     * orderFd   可选   排序字段的名称，倒序前面加“@”，可以多个
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"total":"总记录数","dataList":[XkPlanExt.jsonOut]}
     *
     */

    //==================================================================================================================
    // 新增
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：新增
     * 使用者：高级用户
     *
     * URL：xkp!newRec.action
     *
     * 参数：
     * termId     必需   学期Id
     * planNO     必需   计划编号
     * planName   必需   计划名称
     * planMeno   可选   计划说明
     * planStart  可选   选课开启时间
     * planEnd    可选   选课关闭时间
     * planDone   可选   选课完成时间
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,message:"成功信息"}
     *
     */

    //==================================================================================================================
    // 修改
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：修改
     * 使用者：高级用户
     *
     * URL：xkp!edit.action
     *
     * 参数：
     * autoId     必需   记录Id
     * termId     可选   学期Id
     * planNO     可选   计划编号
     * planName   可选   计划名称
     * planMeno   可选   计划说明
     * planStart  可选   选课开启时间
     * planEnd    可选   选课关闭时间
     * planDone   可选   选课完成时间
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     * 注意：这里修改“开启时间、关闭时间”，同步影响学生选课任务(T_StuXkTask)
     *
     */

    //==================================================================================================================
    // 开启 / 关闭 / 完成 任务
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：开启 / 关闭 / 完成 任务
     * 使用者：高级用户
     *
     * URL：xkp!chState.action
     *
     * 参数：
     * autod   必需   记录Id
     * state   必需   2开启 3关闭 4完成
     * time    可选   指定时间 -- 没有指定时间，默认当前时间
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     * 注意：同步影响学生选课任务(T_StuXkTask)的状态、及时间
     * 注意：为了让“开启、关闭”操作，不影响原有的时间设置，当原记录存在这2个时间 且 未指定time参数，就不做时间变更
     *
     */

    //==================================================================================================================
    // 删除
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：删除 -- 只能删除状态=1(未启用)、4(完成)
     * 使用者：高级用户
     *
     * URL：xkp!del.action
     *
     * 参数：
     * autod    必需   记录Id
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"删除成功"}
     *
     */

    //==================================================================================================================
