/** 选课报表 */

    /** 选课计划Id       */ private Integer xkpId   ;
    /** 选课计划编号     */ private String  planNO  ;
    /** 选课分组         */ private Integer groupCd ;
    /** 学生班级(行政班) */ private Integer stuClaId;

    /** 学生Id             */ private Integer   stuId  ;
    /** 学期Id             */ private Integer   termId ;
    /** 选课计划Id  (多个) */ private Integer[] xkpIds ;
    /** 选课计划编号(多个) */ private String[]  planNOs;

    //==================================================================================================================
    // 统计“已完成”与“未完成”选课任务的人数
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：统计“已完成”与“未完成”选课任务的人数
     * 使用者：教师(未限制)
     *
     * URL：xkRep!stsNum.action
     *
     * 参数：
     * xkpId      2选1   选课计划Id
     * planNO     2选1   选课计划编号 如果存在xkpId参数，该参数无效
     * groupCd    可选   选课分组
     * stuClaId   可选   学生班级(行政班)
     *
     * 出错返回：{"success":false,"message":"错误信息"}
     * 正确返回：{"success":true,"num1":"已完成选课任务的人数","num2":"未完成选课任务的人数"}
     *
     */

    //==================================================================================================================
    // 获取学生课表信息
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：获取学生课表信息
     * 使用者：教师(未限制)、学生只能查自已相关的记录
     *
     * URL：xkRep!stuWeekSchedule.action
     *
     * 参数：
     * stuId     必需   学生Id [当操作者是学生，该参数无效]
     * xkpIds    可选   选课计划Id  (可多个) --> 获取相应选课计划，学生的选课表
     * planNOs   可选   选课计划编号(可多个) --> 获取相应选课计划，学生的选课表 如果存在xkpIds，则忽略该参数
     * termId    可选   学期Id --> 获取该学期，学生的正式课表：0=当前学期
     *
     * 出错返回：{"success":false,"message":"错误信息"}
     * 正确返回：{"success":true,"lineSched":[[课程+教师+班级+场地]...]}
     *
     */

    //==================================================================================================================
